<abi-corpus path='src/pl/plpgsql/src/plpgsql.so' architecture='elf-amd-x86_64' soname='plpgsql.so'>
  <elf-function-symbols>
    <elf-symbol name='Pg_magic_func' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PG_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pg_finfo_plpgsql_call_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pg_finfo_plpgsql_inline_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pg_finfo_plpgsql_validator' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_build_datatype' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_call_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_exec_get_datum_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_inline_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_ns_lookup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_parser_setup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_recognize_err_condition' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_stmt_typename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='plpgsql_validator' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../src/pl/plpgsql/src/pl_comp.c' language='LANG_C99'>
    <class-decl name='PLpgSQL_function' size-in-bits='4416' is-struct='yes' visibility='default' id='030ac029'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn_signature' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn_oid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fn_xmin' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fn_tid' type-id='f228c910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fn_is_trigger' type-id='cf86bdd2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fn_input_collation' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fn_hashkey' type-id='4eebb19f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fn_cxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fn_rettype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='fn_rettyplen' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fn_retbyval' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='fn_retistuple' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='fn_retisdomain' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='472'>
        <var-decl name='fn_retset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='fn_readonly' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='fn_prokind' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fn_nargs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='fn_argvarnos' type-id='9715b4e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='out_param_varno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='found_varno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='new_varno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='old_varno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='resolve_option' type-id='33f41e40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='print_strict_params' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='extra_warnings' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='extra_errors' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='ndatums' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='datums' type-id='a4efa950' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='copiable_size' type-id='305ff205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='action' type-id='eca75285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='nstatements' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='requires_procedure_resowner' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='cur_estate' type-id='1b126ff9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='use_count' type-id='7359adad' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MemoryContextMethods' type-id='af602f35' id='cfc760f8'/>
    <class-decl name='MemoryContextMethods' size-in-bits='640' is-struct='yes' visibility='default' id='af602f35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alloc' type-id='5858793f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_p' type-id='b7f9d8e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='realloc' type-id='6403b1fa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reset' type-id='9c3ff8a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='delete_context' type-id='9c3ff8a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_chunk_context' type-id='ba89cebd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_chunk_space' type-id='50bede38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='is_empty' type-id='34540a4d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stats' type-id='1394b3ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='check' type-id='9c3ff8a7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MemoryStatsPrintFunc' type-id='7fba09f6' id='80668b97'/>
    <typedef-decl name='MemoryContextCounters' type-id='9c9fd134' id='edb1c15f'/>
    <class-decl name='MemoryContextCounters' size-in-bits='256' is-struct='yes' visibility='default' id='9c9fd134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nblocks' type-id='305ff205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='freechunks' type-id='305ff205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='totalspace' type-id='305ff205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='freespace' type-id='305ff205' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MemoryContextCallback' type-id='06678ae2' id='37349209'/>
    <class-decl name='MemoryContextCallback' size-in-bits='192' is-struct='yes' visibility='default' id='06678ae2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='f401d9ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='ce502280' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MemoryContextCallbackFunction' type-id='b7f9d8e6' id='f401d9ad'/>
    <class-decl name='PLpgSQL_execstate' size-in-bits='1920' is-struct='yes' visibility='default' id='dc7edfa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='c9560f01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trigdata' type-id='80983f93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='evtrigdata' type-id='70e42b81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='retval' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='retisnull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='rettype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fn_rettype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='retistuple' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='retisset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='readonly_func' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='376'>
        <var-decl name='atomic' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='exitlabel' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cur_error' type-id='f2dff411' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tuple_store' type-id='e43b772f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tuple_store_desc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tuple_store_cxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tuple_store_owner' type-id='2d5e7217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rsi' type-id='966dbf3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='found_varno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='ndatums' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='datums' type-id='a4efa950' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='datum_context' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='paramLI' type-id='4ff08111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='simple_eval_estate' type-id='d20936cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='simple_eval_resowner' type-id='2d5e7217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='procedure_resowner' type-id='2d5e7217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='cast_hash' type-id='6c5dd83c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='stmt_mcontext' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='stmt_mcontext_parent' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='eval_tuptable' type-id='6f28dedb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='eval_processed' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='eval_econtext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='err_stmt' type-id='583566eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='err_var' type-id='e4d9ce05' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='err_text' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='plugin_info' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PLpgSQL_function' type-id='030ac029' id='ce21d3e0'/>
    <typedef-decl name='TriggerData' type-id='9bf0c9f3' id='adb604d8'/>
    <class-decl name='TriggerData' size-in-bits='640' is-struct='yes' visibility='default' id='9bf0c9f3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tg_event' type-id='2b6c27d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tg_relation' type-id='c79d68a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tg_trigtuple' type-id='3de55dac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tg_newtuple' type-id='3de55dac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tg_trigger' type-id='b8734eab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tg_trigslot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tg_newslot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tg_oldtable' type-id='e43b772f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tg_newtable' type-id='e43b772f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tg_updatedcols' type-id='e873e795' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Relation' type-id='27104061' id='c79d68a8'/>
    <class-decl name='RelationData' size-in-bits='3840' is-struct='yes' visibility='default' id='a73b6b59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_locator' type-id='b67cbde5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rd_smgr' type-id='80a274b1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rd_refcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='rd_backend' type-id='71ae5a39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rd_islocaltemp' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='rd_isnailed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='rd_isvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='rd_indexvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='rd_statvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rd_createSubid' type-id='5f59ae47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='rd_newRelfilelocatorSubid' type-id='5f59ae47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rd_firstRelfilelocatorSubid' type-id='5f59ae47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='rd_droppedSubid' type-id='5f59ae47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rd_rel' type-id='053ec625' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='rd_att' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rd_id' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='rd_lockInfo' type-id='0ec0059f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rd_rules' type-id='566804c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rd_rulescxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='trigdesc' type-id='457b83dc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='rd_rsdesc' type-id='db26e016' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='rd_fkeylist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rd_fkeyvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='rd_partkey' type-id='33ddacc1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='rd_partkeycxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='rd_partdesc' type-id='a63f38eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='rd_pdcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='rd_partdesc_nodetached' type-id='a63f38eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='rd_pddcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='rd_partdesc_nodetached_xmin' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='rd_partcheck' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rd_partcheckvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='rd_partcheckcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='rd_indexlist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='rd_pkindex' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='rd_replidindex' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='rd_statlist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='rd_attrsvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='rd_keyattr' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rd_pkattr' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='rd_idattr' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='rd_hotblockingattr' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='rd_summarizedattr' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='rd_pubdesc' type-id='469dd726' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='rd_options' type-id='dd173450' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rd_amhandler' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rd_tableam' type-id='eca96808' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='rd_index' type-id='320f78a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='rd_indextuple' type-id='7b21fc8f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='rd_indexcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='rd_indam' type-id='6196cdc7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rd_opfamily' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='rd_opcintype' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='rd_support' type-id='8bf9597c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='rd_supportinfo' type-id='335fd961' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='rd_indoption' type-id='660e0121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='rd_indexprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='rd_indpred' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='rd_exclops' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='rd_exclprocs' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='rd_exclstrats' type-id='a2b66e08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='rd_indcollation' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='rd_opcoptions' type-id='85879c0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='rd_amcache' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='rd_fdwroutine' type-id='db4b126e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='rd_toastoid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='pgstat_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='pgstat_info' type-id='fe8c4a8b' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ReturnSetInfo' type-id='5c2924dd' id='785ba03a'/>
    <class-decl name='ReturnSetInfo' size-in-bits='448' is-struct='yes' visibility='default' id='5c2924dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='econtext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='expectedDesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allowedModes' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='returnMode' type-id='3c64eef9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='isDone' type-id='a15d5633' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='setResult' type-id='e43b772f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='setDesc' type-id='39243d9b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprContext' size-in-bits='1024' is-struct='yes' visibility='default' id='a0a26f31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ecxt_scantuple' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ecxt_innertuple' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ecxt_outertuple' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ecxt_per_query_memory' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ecxt_per_tuple_memory' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ecxt_param_exec_vals' type-id='94926d07' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ecxt_param_list_info' type-id='4ff08111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ecxt_aggvalues' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ecxt_aggnulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='caseValue_datum' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='caseValue_isNull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='domainValue_datum' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='domainValue_isNull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ecxt_estate' type-id='d20936cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ecxt_callbacks' type-id='4b1e905b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='EState' size-in-bits='2432' is-struct='yes' visibility='default' id='88ee323d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='es_direction' type-id='f403d182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='es_snapshot' type-id='7f2324e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='es_crosscheck_snapshot' type-id='7f2324e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='es_range_table' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='es_range_table_size' type-id='b14ca5c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='es_relations' type-id='610afcf1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='es_rowmarks' type-id='bbc29af9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='es_rteperminfos' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='es_plannedstmt' type-id='579971b3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='es_sourceText' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='es_junkFilter' type-id='763b1c4d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='es_output_cid' type-id='6692fd60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='es_result_relations' type-id='860c2a6f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='es_opened_result_relations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='es_partition_directory' type-id='97164569' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='es_tuple_routing_result_relations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='es_trig_target_relations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='es_param_list_info' type-id='4ff08111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='es_param_exec_vals' type-id='94926d07' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='es_queryEnv' type-id='74ab5782' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='es_query_cxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='es_tupleTable' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='es_processed' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='es_total_processed' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='es_top_eflags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='es_instrument' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='es_finished' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='es_exprcontexts' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='es_subplanstates' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='es_auxmodifytables' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='es_per_tuple_exprcontext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='es_epq_active' type-id='3a68d90a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='es_use_parallel_mode' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='es_query_dsa' type-id='fbc5e3ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='es_jit_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='es_jit' type-id='24d6a8d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='es_jit_worker_instr' type-id='76399dc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='es_insert_pending_result_relations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='es_insert_pending_modifytables' type-id='c2e26fd1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ExecRowMark' size-in-bits='448' is-struct='yes' visibility='default' id='64bdbbb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='relation' type-id='c79d68a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='relid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rti' type-id='b14ca5c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prti' type-id='b14ca5c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rowmarkId' type-id='b14ca5c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='markType' type-id='de7882c1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='strength' type-id='4f5c07df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='waitPolicy' type-id='5016605c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ermActive' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='curCtid' type-id='f228c910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ermExtra' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ResultRelInfo' type-id='1c3932b7' id='a41dd398'/>
    <class-decl name='ResultRelInfo' size-in-bits='2880' is-struct='yes' visibility='default' id='1c3932b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ri_RangeTableIndex' type-id='b14ca5c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ri_RelationDesc' type-id='c79d68a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ri_NumIndices' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ri_IndexRelationDescs' type-id='f3975292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ri_IndexRelationInfo' type-id='db19172f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ri_RowIdAttNo' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ri_extraUpdatedCols' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ri_projectNew' type-id='a5c2be02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ri_newTupleSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ri_oldTupleSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ri_projectNewInfoValid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ri_TrigDesc' type-id='457b83dc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ri_TrigFunctions' type-id='335fd961' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ri_TrigWhenExprs' type-id='35406223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ri_TrigInstrument' type-id='83bfdd55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ri_ReturningSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ri_TrigOldSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ri_TrigNewSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ri_FdwRoutine' type-id='db4b126e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ri_FdwState' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ri_usesFdwDirectModify' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='ri_NumSlots' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ri_NumSlotsInitialized' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='ri_BatchSize' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ri_Slots' type-id='052cd977' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ri_PlanSlots' type-id='052cd977' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ri_WithCheckOptions' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ri_WithCheckOptionExprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ri_ConstraintExprs' type-id='35406223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='ri_GeneratedExprsI' type-id='35406223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ri_GeneratedExprsU' type-id='35406223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ri_NumGeneratedNeededI' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='ri_NumGeneratedNeededU' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='ri_returningList' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='ri_projectReturning' type-id='a5c2be02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='ri_onConflictArbiterIndexes' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='ri_onConflict' type-id='c926e317' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='ri_matchedMergeAction' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='ri_notMatchedMergeAction' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='ri_PartitionCheckExpr' type-id='6460b71b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='ri_ChildToRootMap' type-id='163db565' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='ri_ChildToRootMapValid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='ri_RootToChildMap' type-id='163db565' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='ri_RootToChildMapValid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='ri_RootResultRelInfo' type-id='3b472d1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='ri_PartitionTupleSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='ri_CopyMultiInsertBuffer' type-id='d6dea224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ri_ancestorResultRels' type-id='c2e26fd1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='RelationPtr' type-id='610afcf1' id='f3975292'/>
    <typedef-decl name='IndexInfo' type-id='2268c427' id='75254514'/>
    <class-decl name='IndexInfo' size-in-bits='1536' is-struct='yes' visibility='default' id='2268c427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ii_NumIndexAttrs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ii_NumIndexKeyAttrs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ii_IndexAttrNumbers' type-id='1e675450' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ii_Expressions' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ii_ExpressionsState' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ii_Predicate' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ii_PredicateState' type-id='6460b71b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ii_ExclusionOps' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ii_ExclusionProcs' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ii_ExclusionStrats' type-id='a2b66e08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ii_UniqueOps' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ii_UniqueProcs' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ii_UniqueStrats' type-id='a2b66e08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ii_Unique' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1288'>
        <var-decl name='ii_NullsNotDistinct' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1296'>
        <var-decl name='ii_ReadyForInserts' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1304'>
        <var-decl name='ii_CheckedUnchanged' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='ii_IndexUnchanged' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1320'>
        <var-decl name='ii_Concurrent' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1328'>
        <var-decl name='ii_BrokenHotChain' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1336'>
        <var-decl name='ii_Summarizing' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ii_ParallelWorkers' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='ii_Am' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ii_AmCache' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ii_Context' type-id='9968f2f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprState' size-in-bits='896' is-struct='yes' visibility='default' id='96070c1b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='78b39644' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='resnull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resvalue' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resultslot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='steps' type-id='f5da7878' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='evalfunc' type-id='636a14ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='expr' type-id='f57d71ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='evalfunc_private' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='steps_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='steps_alloc' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parent' type-id='22f23587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ext_params' type-id='4ff08111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='innermost_caseval' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='innermost_casenull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='innermost_domainval' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='innermost_domainnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PlanState' size-in-bits='1600' is-struct='yes' visibility='default' id='5501a66f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='plan' type-id='5fc51fc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='state' type-id='d20936cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ExecProcNode' type-id='980aaae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ExecProcNodeReal' type-id='980aaae4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='instrument' type-id='83bfdd55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='worker_instrument' type-id='91a0b133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='worker_jit_instrument' type-id='fc394b83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='qual' type-id='6460b71b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='lefttree' type-id='22f23587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='righttree' type-id='22f23587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='initPlan' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='subPlan' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='chgParam' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ps_ResultTupleDesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='ps_ResultTupleSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ps_ExprContext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='ps_ProjInfo' type-id='a5c2be02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='async_capable' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='scandesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='scanops' type-id='a722f4b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='outerops' type-id='a722f4b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='innerops' type-id='a722f4b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='resultops' type-id='a722f4b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='scanopsfixed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1544'>
        <var-decl name='outeropsfixed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='inneropsfixed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='resultopsfixed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='scanopsset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1576'>
        <var-decl name='outeropsset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1584'>
        <var-decl name='inneropsset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1592'>
        <var-decl name='resultopsset' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='EState' type-id='88ee323d' id='bce5e02c'/>
    <typedef-decl name='ExprState' type-id='96070c1b' id='31d0348c'/>
    <typedef-decl name='ExprContext' type-id='a0a26f31' id='bc564a52'/>
    <typedef-decl name='ProjectionInfo' type-id='aa2bff84' id='53ba63d9'/>
    <class-decl name='ProjectionInfo' size-in-bits='1024' is-struct='yes' visibility='default' id='aa2bff84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pi_state' type-id='31d0348c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pi_exprContext' type-id='47bae389' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='OnConflictSetState' type-id='b6b96f8f' id='e594b096'/>
    <class-decl name='OnConflictSetState' size-in-bits='320' is-struct='yes' visibility='default' id='b6b96f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oc_Existing' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='oc_ProjSlot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='oc_ProjInfo' type-id='a5c2be02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='oc_WhereClause' type-id='6460b71b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='EPQState' size-in-bits='832' is-struct='yes' visibility='default' id='23a7186c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parentestate' type-id='d20936cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epqParam' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resultRelations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tuple_table' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='relsubs_slot' type-id='052cd977' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='plan' type-id='5fc51fc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='arowMarks' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='origslot' type-id='336f4727' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='recheckestate' type-id='d20936cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='relsubs_rowmark' type-id='2bf11ac7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='relsubs_done' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='relsubs_blocked' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='recheckplanstate' type-id='22f23587' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ExecAuxRowMark' type-id='55e42c9f' id='9ef9edc2'/>
    <class-decl name='ExecAuxRowMark' size-in-bits='128' is-struct='yes' visibility='default' id='55e42c9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rowmark' type-id='5cb9f8e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctidAttNo' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='toidAttNo' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='wholeAttNo' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ExecRowMark' type-id='64bdbbb1' id='ac55978e'/>
    <typedef-decl name='PlanState' type-id='5501a66f' id='7f232f50'/>
    <typedef-decl name='PLpgSQL_variable' type-id='3bb420e5' id='a7723a38'/>
    <class-decl name='PLpgSQL_variable' size-in-bits='256' is-struct='yes' visibility='default' id='3bb420e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dtype' type-id='8fdeefdc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='refname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lineno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='isconst' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='notnull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='default_val' type-id='575e2304' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PLpgSQL_expr' type-id='6d218c8e' id='395172af'/>
    <class-decl name='PLpgSQL_expr' size-in-bits='960' is-struct='yes' visibility='default' id='6d218c8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='query' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parseMode' type-id='79179ab2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='plan' type-id='98abc875' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='paramnos' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func' type-id='c9560f01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ns' type-id='f0068755' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='expr_simple_expr' type-id='f57d71ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='expr_simple_type' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='expr_simple_typmod' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='expr_simple_mutable' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='target_param' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='expr_rw_param' type-id='4c6e7968' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='expr_simple_plansource' type-id='f6d6a649' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='expr_simple_plan' type-id='da707eb2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='expr_simple_plan_lxid' type-id='52debaec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='expr_simple_state' type-id='6460b71b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='expr_simple_in_use' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='expr_simple_lxid' type-id='52debaec' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ParseState' size-in-bits='1792' is-struct='yes' visibility='default' id='aeb18879'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parentParseState' type-id='63c837a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_sourcetext' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_rtable' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_rteperminfos' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_joinexprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_nullingrels' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_joinlist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='p_namespace' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='p_lateral_active' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_ctenamespace' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='p_future_ctes' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_parent_cte' type-id='8c1a5c4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='p_target_relation' type-id='c79d68a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='p_target_nsitem' type-id='6883c46a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='p_is_insert' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='p_windowdefs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='p_expr_kind' type-id='168841d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='p_next_resno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='p_multiassign_exprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='p_locking_clause' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='p_locked_from_parent' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1224'>
        <var-decl name='p_resolve_unknowns' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='p_queryEnv' type-id='74ab5782' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='p_hasAggs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='p_hasWindowFuncs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='p_hasTargetSRFs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1368'>
        <var-decl name='p_hasSubLinks' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='p_hasModifyingCTE' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='p_last_srf' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='p_pre_columnref_hook' type-id='c6ea5968' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='p_post_columnref_hook' type-id='4afcb79b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='p_paramref_hook' type-id='2fc99baa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='p_coerce_param_hook' type-id='c4d0a731' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='p_ref_hook_state' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FunctionCallInfo' type-id='046659d6' id='cbf1f028'/>
    <class-decl name='FunctionCallInfoBaseData' size-in-bits='256' is-struct='yes' visibility='default' id='23024950'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flinfo' type-id='335fd961' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context' type-id='89bbd655' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resultinfo' type-id='89bbd655' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fncollation' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='isnull' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nargs' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='args' type-id='a03a8123' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='23a7186c' size-in-bits='64' id='3a68d90a'/>
    <pointer-type-def type-id='bce5e02c' size-in-bits='64' id='d20936cd'/>
    <pointer-type-def type-id='9ef9edc2' size-in-bits='64' id='2a5c1257'/>
    <pointer-type-def type-id='2a5c1257' size-in-bits='64' id='2bf11ac7'/>
    <pointer-type-def type-id='64bdbbb1' size-in-bits='64' id='5cb9f8e9'/>
    <pointer-type-def type-id='5cb9f8e9' size-in-bits='64' id='bbc29af9'/>
    <pointer-type-def type-id='bc564a52' size-in-bits='64' id='47bae389'/>
    <pointer-type-def type-id='00165dba' size-in-bits='64' id='4b1e905b'/>
    <pointer-type-def type-id='31d0348c' size-in-bits='64' id='6460b71b'/>
    <pointer-type-def type-id='6460b71b' size-in-bits='64' id='35406223'/>
    <pointer-type-def type-id='e46e0d79' size-in-bits='64' id='335fd961'/>
    <pointer-type-def type-id='23024950' size-in-bits='64' id='046659d6'/>
    <pointer-type-def type-id='07fb1a17' size-in-bits='64' id='7b21fc8f'/>
    <pointer-type-def type-id='75254514' size-in-bits='64' id='2dfd855f'/>
    <pointer-type-def type-id='2dfd855f' size-in-bits='64' id='db19172f'/>
    <pointer-type-def type-id='06678ae2' size-in-bits='64' id='ce502280'/>
    <pointer-type-def type-id='edb1c15f' size-in-bits='64' id='dbe61d52'/>
    <pointer-type-def type-id='e594b096' size-in-bits='64' id='c926e317'/>
    <pointer-type-def type-id='dc7edfa1' size-in-bits='64' id='1b126ff9'/>
    <pointer-type-def type-id='395172af' size-in-bits='64' id='575e2304'/>
    <pointer-type-def type-id='ce21d3e0' size-in-bits='64' id='c9560f01'/>
    <pointer-type-def type-id='a7723a38' size-in-bits='64' id='e4d9ce05'/>
    <pointer-type-def type-id='547991cd' size-in-bits='64' id='4c6e7968'/>
    <pointer-type-def type-id='aeb18879' size-in-bits='64' id='63c837a2'/>
    <pointer-type-def type-id='5501a66f' size-in-bits='64' id='22f23587'/>
    <pointer-type-def type-id='53ba63d9' size-in-bits='64' id='a5c2be02'/>
    <pointer-type-def type-id='c79d68a8' size-in-bits='64' id='610afcf1'/>
    <pointer-type-def type-id='a73b6b59' size-in-bits='64' id='27104061'/>
    <pointer-type-def type-id='1c3932b7' size-in-bits='64' id='3b472d1f'/>
    <pointer-type-def type-id='3b472d1f' size-in-bits='64' id='860c2a6f'/>
    <pointer-type-def type-id='785ba03a' size-in-bits='64' id='966dbf3d'/>
    <pointer-type-def type-id='adb604d8' size-in-bits='64' id='80983f93'/>
    <pointer-type-def type-id='ee55b4c1' size-in-bits='64' id='34540a4d'/>
    <qualified-type-def type-id='cfc760f8' const='yes' id='3546ca68'/>
    <pointer-type-def type-id='3546ca68' size-in-bits='64' id='207065e6'/>
    <pointer-type-def type-id='b1c41459' size-in-bits='64' id='ba89cebd'/>
    <pointer-type-def type-id='ab20941e' size-in-bits='64' id='50bede38'/>
    <pointer-type-def type-id='4727a413' size-in-bits='64' id='9c3ff8a7'/>
    <pointer-type-def type-id='f5e36494' size-in-bits='64' id='1394b3ce'/>
    <pointer-type-def type-id='704d2234' size-in-bits='64' id='7fba09f6'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='82c498eb' size-in-bits='64' id='5858793f'/>
    <pointer-type-def type-id='76683798' size-in-bits='64' id='6403b1fa'/>
    <var-decl name='plpgsql_parse_result' type-id='eca75285' visibility='default'/>
    <var-decl name='plpgsql_nDatums' type-id='95e97e5e' visibility='default'/>
    <var-decl name='plpgsql_Datums' type-id='a4efa950' visibility='default'/>
    <var-decl name='plpgsql_error_funcname' type-id='26a90f95' visibility='default'/>
    <var-decl name='plpgsql_DumpExecTree' type-id='c894953d' visibility='default'/>
    <var-decl name='plpgsql_check_syntax' type-id='c894953d' visibility='default'/>
    <var-decl name='plpgsql_curr_compile' type-id='c9560f01' visibility='default'/>
    <var-decl name='plpgsql_compile_tmp_cxt' type-id='9968f2f6' visibility='default'/>
    <function-decl name='plpgsql_recognize_err_condition' mangled-name='plpgsql_recognize_err_condition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='plpgsql_recognize_err_condition'>
      <parameter type-id='80f4b756' name='condname'/>
      <parameter type-id='c894953d' name='allow_sqlstate'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='plpgsql_build_datatype' mangled-name='plpgsql_build_datatype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='plpgsql_build_datatype'>
      <parameter type-id='63cf087c' name='typeOid'/>
      <parameter type-id='93e3c360' name='typmod'/>
      <parameter type-id='63cf087c' name='collation'/>
      <parameter type-id='9ec4c26c' name='origtypname'/>
      <return type-id='b02e3f7d'/>
    </function-decl>
    <function-decl name='plpgsql_parser_setup' mangled-name='plpgsql_parser_setup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='plpgsql_parser_setup'>
      <parameter type-id='63c837a2' name='pstate'/>
      <parameter type-id='575e2304' name='expr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='plpgsql_compile' mangled-name='plpgsql_compile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='plpgsql_compile'>
      <parameter type-id='cbf1f028' name='fcinfo'/>
      <parameter type-id='c894953d' name='forValidator'/>
      <return type-id='c9560f01'/>
    </function-decl>
    <array-type-def dimensions='1' type-id='6bdc0c3e' size-in-bits='512' id='1e675450'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <pointer-type-def type-id='d0a434ed' size-in-bits='64' id='e8c55cbc'/>
    <pointer-type-def type-id='421dd424' size-in-bits='64' id='da707eb2'/>
    <pointer-type-def type-id='86833f90' size-in-bits='64' id='f6d6a649'/>
    <pointer-type-def type-id='d52d60c4' size-in-bits='64' id='8c1a5c4f'/>
    <pointer-type-def type-id='daee8f6e' size-in-bits='64' id='d6dea224'/>
    <pointer-type-def type-id='f24b0a4f' size-in-bits='64' id='87794d52'/>
    <pointer-type-def type-id='a0fdc2ea' size-in-bits='64' id='f2dff411'/>
    <pointer-type-def type-id='c23f55f0' size-in-bits='64' id='70e42b81'/>
    <pointer-type-def type-id='c0a129cb' size-in-bits='64' id='f57d71ec'/>
    <pointer-type-def type-id='d3b295aa' size-in-bits='64' id='f5da7878'/>
    <pointer-type-def type-id='870496e8' size-in-bits='64' id='db4b126e'/>
    <pointer-type-def type-id='09c852cb' size-in-bits='64' id='6c5dd83c'/>
    <pointer-type-def type-id='0fa0ca0f' size-in-bits='64' id='6196cdc7'/>
    <pointer-type-def type-id='25f39bce' size-in-bits='64' id='83bfdd55'/>
    <pointer-type-def type-id='67f61e43' size-in-bits='64' id='24d6a8d3'/>
    <pointer-type-def type-id='adb8d8aa' size-in-bits='64' id='76399dc8'/>
    <pointer-type-def type-id='512b66a8' size-in-bits='64' id='763b1c4d'/>
    <pointer-type-def type-id='db0045d4' size-in-bits='64' id='c2e26fd1'/>
    <pointer-type-def type-id='717e4c75' size-in-bits='64' id='86bcc405'/>
    <array-type-def dimensions='1' type-id='73f7fd18' size-in-bits='infinite' id='a03a8123'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='63cf087c' size-in-bits='64' id='42f3594b'/>
    <pointer-type-def type-id='42d4c35a' size-in-bits='64' id='a4efa950'/>
    <pointer-type-def type-id='c32716ea' size-in-bits='64' id='4eebb19f'/>
    <pointer-type-def type-id='a47fdee5' size-in-bits='64' id='f0068755'/>
    <pointer-type-def type-id='79e2ce06' size-in-bits='64' id='583566eb'/>
    <pointer-type-def type-id='f9084154' size-in-bits='64' id='eca75285'/>
    <pointer-type-def type-id='c5027e70' size-in-bits='64' id='b02e3f7d'/>
    <pointer-type-def type-id='ec58a07c' size-in-bits='64' id='94926d07'/>
    <pointer-type-def type-id='2167e055' size-in-bits='64' id='6883c46a'/>
    <pointer-type-def type-id='37a337dc' size-in-bits='64' id='63c837a1'/>
    <pointer-type-def type-id='7e3f796b' size-in-bits='64' id='fe8c4a8b'/>
    <pointer-type-def type-id='58a10fda' size-in-bits='64' id='5fc51fc8'/>
    <pointer-type-def type-id='a0780334' size-in-bits='64' id='579971b3'/>
    <pointer-type-def type-id='03d04117' size-in-bits='64' id='469dd726'/>
    <pointer-type-def type-id='7345a329' size-in-bits='64' id='74ab5782'/>
    <pointer-type-def type-id='e59e47cf' size-in-bits='64' id='8bf9597c'/>
    <pointer-type-def type-id='09e09440' size-in-bits='64' id='db26e016'/>
    <pointer-type-def type-id='fa5e6a1d' size-in-bits='64' id='566804c2'/>
    <pointer-type-def type-id='b46b9160' size-in-bits='64' id='6f28dedb'/>
    <pointer-type-def type-id='94925cc3' size-in-bits='64' id='fc394b83'/>
    <pointer-type-def type-id='fd4d0dd0' size-in-bits='64' id='b8734eab'/>
    <pointer-type-def type-id='1b2f0781' size-in-bits='64' id='457b83dc'/>
    <pointer-type-def type-id='e434b0a4' size-in-bits='64' id='163db565'/>
    <pointer-type-def type-id='1f0b318a' size-in-bits='64' id='336f4727'/>
    <pointer-type-def type-id='336f4727' size-in-bits='64' id='052cd977'/>
    <pointer-type-def type-id='8b7bc69c' size-in-bits='64' id='e43b772f'/>
    <pointer-type-def type-id='d1d2d2bf' size-in-bits='64' id='9ec4c26c'/>
    <pointer-type-def type-id='d39d25d0' size-in-bits='64' id='91a0b133'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <pointer-type-def type-id='c894953d' size-in-bits='64' id='d8e6b335'/>
    <pointer-type-def type-id='0fb10f85' size-in-bits='64' id='dd173450'/>
    <pointer-type-def type-id='dd173450' size-in-bits='64' id='85879c0e'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='7f7ccb1d' size-in-bits='64' id='e873e795'/>
    <pointer-type-def type-id='57141cf2' size-in-bits='64' id='eca96808'/>
    <pointer-type-def type-id='0668e6ba' size-in-bits='64' id='a722f4b0'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='255914cd' size-in-bits='64' id='fbc5e3ad'/>
    <function-type size-in-bits='64' id='ee55b4c1'>
      <parameter type-id='9968f2f6'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='b1c41459'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='9968f2f6'/>
    </function-type>
    <function-type size-in-bits='64' id='ab20941e'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='305ff205'/>
    </function-type>
    <function-type size-in-bits='64' id='4727a413'>
      <parameter type-id='9968f2f6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f5e36494'>
      <parameter type-id='9968f2f6'/>
      <parameter type-id='80668b97'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='dbe61d52'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='704d2234'>
      <parameter type-id='9968f2f6'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='82c498eb'>
      <parameter type-id='9968f2f6'/>
      <parameter type-id='305ff205'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <function-type size-in-bits='64' id='76683798'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='305ff205'/>
      <return type-id='eaa32e2f'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <pointer-type-def type-id='27de9c2e' size-in-bits='64' id='660e0121'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='3200' id='9715b4e5'>
      <subrange length='100' type-id='7359adad' id='4196563c'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <class-decl name='FmgrInfo' size-in-bits='384' is-struct='yes' visibility='default' id='e46e0d79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn_addr' type-id='bf77460d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn_oid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fn_nargs' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='fn_strict' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='fn_retset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fn_stats' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fn_extra' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fn_mcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fn_expr' type-id='89bbd655' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='HeapTupleData' size-in-bits='192' is-struct='yes' visibility='default' id='07fb1a17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='t_len' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='t_self' type-id='f228c910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='t_tableOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='t_data' type-id='0dfa8919' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AttrNumber' type-id='27de9c2e' id='6bdc0c3e'/>
    <typedef-decl name='BackendId' type-id='95e97e5e' id='71ae5a39'/>
    <typedef-decl name='CoerceParamHook' type-id='915248f0' id='c4d0a731'/>
    <typedef-decl name='CommandId' type-id='7aa912f5' id='6692fd60'/>
    <typedef-decl name='Datum' type-id='e475ab95' id='f24b0a4f'/>
    <typedef-decl name='ExecProcNodeMtd' type-id='cf53b5e2' id='980aaae4'/>
    <typedef-decl name='ExprContext_CB' type-id='7cf0472b' id='00165dba'/>
    <typedef-decl name='ExprDoneCond' type-id='3fed383f' id='a15d5633'/>
    <typedef-decl name='ExprStateEvalFunc' type-id='1759c1b2' id='636a14ac'/>
    <typedef-decl name='Form_pg_class' type-id='5523530c' id='053ec625'/>
    <typedef-decl name='Form_pg_index' type-id='7a0bd728' id='320f78a9'/>
    <typedef-decl name='HeapTuple' type-id='7b21fc90' id='3de55dac'/>
    <typedef-decl name='Index' type-id='f0981eeb' id='b14ca5c8'/>
    <typedef-decl name='ItemPointerData' type-id='9dcce3ff' id='f228c910'/>
    <typedef-decl name='LocalTransactionId' type-id='7aa912f5' id='52debaec'/>
    <typedef-decl name='LockClauseStrength' type-id='c58fd1e3' id='4f5c07df'/>
    <typedef-decl name='LockInfoData' type-id='746df812' id='0ec0059f'/>
    <typedef-decl name='LockWaitPolicy' type-id='b8b605a0' id='5016605c'/>
    <typedef-decl name='MemoryContext' type-id='34bdb839' id='9968f2f6'/>
    <typedef-decl name='NodeTag' type-id='8a25f004' id='57011038'/>
    <typedef-decl name='Oid' type-id='f0981eeb' id='63cf087c'/>
    <typedef-decl name='PLpgSQL_datum_type' type-id='75857318' id='8fdeefdc'/>
    <typedef-decl name='PLpgSQL_resolve_option' type-id='6587f404' id='33f41e40'/>
    <typedef-decl name='PLpgSQL_trigtype' type-id='7a8f9736' id='cf86bdd2'/>
    <typedef-decl name='Param' type-id='24900a7a' id='547991cd'/>
    <typedef-decl name='ParamListInfo' type-id='ca0e7f8c' id='4ff08111'/>
    <typedef-decl name='ParseExprKind' type-id='6578095e' id='168841d2'/>
    <typedef-decl name='ParseParamRefHook' type-id='13679b7c' id='2fc99baa'/>
    <typedef-decl name='PartitionDesc' type-id='658e7622' id='a63f38eb'/>
    <typedef-decl name='PartitionDirectory' type-id='358e4672' id='97164569'/>
    <typedef-decl name='PartitionKey' type-id='74ab1d06' id='33ddacc1'/>
    <typedef-decl name='PostParseColumnRefHook' type-id='0c5337d7' id='4afcb79b'/>
    <typedef-decl name='PreParseColumnRefHook' type-id='8b232c55' id='c6ea5968'/>
    <typedef-decl name='RawParseMode' type-id='08f5ca17' id='79179ab2'/>
    <typedef-decl name='RelFileLocator' type-id='99549310' id='b67cbde5'/>
    <typedef-decl name='ResourceOwner' type-id='c6fe2952' id='2d5e7217'/>
    <typedef-decl name='RowMarkType' type-id='c13ee7d5' id='de7882c1'/>
    <typedef-decl name='SMgrRelation' type-id='47c63816' id='80a274b1'/>
    <typedef-decl name='SPIPlanPtr' type-id='d4c733bc' id='98abc875'/>
    <typedef-decl name='ScanDirection' type-id='b25f871e' id='f403d182'/>
    <typedef-decl name='SetFunctionReturnMode' type-id='40ed39d2' id='3c64eef9'/>
    <typedef-decl name='Size' type-id='b59d7dce' id='305ff205'/>
    <typedef-decl name='Snapshot' type-id='06d5c805' id='7f2324e8'/>
    <typedef-decl name='SubTransactionId' type-id='7aa912f5' id='5f59ae47'/>
    <typedef-decl name='TransactionId' type-id='7aa912f5' id='2d7d3949'/>
    <typedef-decl name='TriggerEvent' type-id='7aa912f5' id='2b6c27d8'/>
    <typedef-decl name='TupleDesc' type-id='455f1eca' id='39243d9b'/>
    <typedef-decl name='fmNodePtr' type-id='86bcc405' id='89bbd655'/>
    <typedef-decl name='int32' type-id='95e97e5e' id='93e3c360'/>
    <typedef-decl name='uint64' type-id='7359adad' id='f69d0a36'/>
    <typedef-decl name='uint8' type-id='002ac4a6' id='78b39644'/>
    <pointer-type-def type-id='06a3df2b' size-in-bits='64' id='a2b66e08'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='cf1c8d75' size-in-bits='64' id='5523530c'/>
    <pointer-type-def type-id='4d9fe359' size-in-bits='64' id='7a0bd728'/>
    <pointer-type-def type-id='e5c4cc54' size-in-bits='64' id='7b21fc90'/>
    <pointer-type-def type-id='60ea65f1' size-in-bits='64' id='34bdb839'/>
    <pointer-type-def type-id='2b45aa39' size-in-bits='64' id='8b232c55'/>
    <pointer-type-def type-id='852ff403' size-in-bits='64' id='0c5337d7'/>
    <pointer-type-def type-id='9d26c5b6' size-in-bits='64' id='915248f0'/>
    <pointer-type-def type-id='2520a912' size-in-bits='64' id='13679b7c'/>
    <pointer-type-def type-id='d86ba563' size-in-bits='64' id='42d4c35a'/>
    <pointer-type-def type-id='e1501ec6' size-in-bits='64' id='ca0e7f8c'/>
    <pointer-type-def type-id='6678ac94' size-in-bits='64' id='658e7622'/>
    <pointer-type-def type-id='9cf45a44' size-in-bits='64' id='358e4672'/>
    <pointer-type-def type-id='d3523890' size-in-bits='64' id='74ab1d06'/>
    <pointer-type-def type-id='d301d814' size-in-bits='64' id='c6fe2952'/>
    <pointer-type-def type-id='bcdd7f90' size-in-bits='64' id='47c63816'/>
    <pointer-type-def type-id='8b267665' size-in-bits='64' id='06d5c805'/>
    <pointer-type-def type-id='e053624c' size-in-bits='64' id='455f1eca'/>
    <pointer-type-def type-id='9ea39988' size-in-bits='64' id='cf53b5e2'/>
    <pointer-type-def type-id='a8e0f606' size-in-bits='64' id='d4c733bc'/>
    <qualified-type-def type-id='d0a434ed' const='yes' id='7f7ccb1d'/>
    <qualified-type-def type-id='9351f42b' const='yes' id='57141cf2'/>
    <qualified-type-def type-id='4ad8af4a' const='yes' id='0668e6ba'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <enum-decl name='LockClauseStrength' id='c58fd1e3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LCS_NONE' value='0'/>
      <enumerator name='LCS_FORKEYSHARE' value='1'/>
      <enumerator name='LCS_FORSHARE' value='2'/>
      <enumerator name='LCS_FORNOKEYUPDATE' value='3'/>
      <enumerator name='LCS_FORUPDATE' value='4'/>
    </enum-decl>
    <enum-decl name='LockWaitPolicy' id='b8b605a0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LockWaitBlock' value='0'/>
      <enumerator name='LockWaitSkip' value='1'/>
      <enumerator name='LockWaitError' value='2'/>
    </enum-decl>
    <enum-decl name='NodeTag' id='8a25f004'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='T_Invalid' value='0'/>
      <enumerator name='T_List' value='1'/>
      <enumerator name='T_Alias' value='2'/>
      <enumerator name='T_RangeVar' value='3'/>
      <enumerator name='T_TableFunc' value='4'/>
      <enumerator name='T_IntoClause' value='5'/>
      <enumerator name='T_Var' value='6'/>
      <enumerator name='T_Const' value='7'/>
      <enumerator name='T_Param' value='8'/>
      <enumerator name='T_Aggref' value='9'/>
      <enumerator name='T_GroupingFunc' value='10'/>
      <enumerator name='T_WindowFunc' value='11'/>
      <enumerator name='T_SubscriptingRef' value='12'/>
      <enumerator name='T_FuncExpr' value='13'/>
      <enumerator name='T_NamedArgExpr' value='14'/>
      <enumerator name='T_OpExpr' value='15'/>
      <enumerator name='T_DistinctExpr' value='16'/>
      <enumerator name='T_NullIfExpr' value='17'/>
      <enumerator name='T_ScalarArrayOpExpr' value='18'/>
      <enumerator name='T_BoolExpr' value='19'/>
      <enumerator name='T_SubLink' value='20'/>
      <enumerator name='T_SubPlan' value='21'/>
      <enumerator name='T_AlternativeSubPlan' value='22'/>
      <enumerator name='T_FieldSelect' value='23'/>
      <enumerator name='T_FieldStore' value='24'/>
      <enumerator name='T_RelabelType' value='25'/>
      <enumerator name='T_CoerceViaIO' value='26'/>
      <enumerator name='T_ArrayCoerceExpr' value='27'/>
      <enumerator name='T_ConvertRowtypeExpr' value='28'/>
      <enumerator name='T_CollateExpr' value='29'/>
      <enumerator name='T_CaseExpr' value='30'/>
      <enumerator name='T_CaseWhen' value='31'/>
      <enumerator name='T_CaseTestExpr' value='32'/>
      <enumerator name='T_ArrayExpr' value='33'/>
      <enumerator name='T_RowExpr' value='34'/>
      <enumerator name='T_RowCompareExpr' value='35'/>
      <enumerator name='T_CoalesceExpr' value='36'/>
      <enumerator name='T_MinMaxExpr' value='37'/>
      <enumerator name='T_SQLValueFunction' value='38'/>
      <enumerator name='T_XmlExpr' value='39'/>
      <enumerator name='T_JsonFormat' value='40'/>
      <enumerator name='T_JsonReturning' value='41'/>
      <enumerator name='T_JsonValueExpr' value='42'/>
      <enumerator name='T_JsonConstructorExpr' value='43'/>
      <enumerator name='T_JsonIsPredicate' value='44'/>
      <enumerator name='T_NullTest' value='45'/>
      <enumerator name='T_BooleanTest' value='46'/>
      <enumerator name='T_CoerceToDomain' value='47'/>
      <enumerator name='T_CoerceToDomainValue' value='48'/>
      <enumerator name='T_SetToDefault' value='49'/>
      <enumerator name='T_CurrentOfExpr' value='50'/>
      <enumerator name='T_NextValueExpr' value='51'/>
      <enumerator name='T_InferenceElem' value='52'/>
      <enumerator name='T_TargetEntry' value='53'/>
      <enumerator name='T_RangeTblRef' value='54'/>
      <enumerator name='T_JoinExpr' value='55'/>
      <enumerator name='T_FromExpr' value='56'/>
      <enumerator name='T_OnConflictExpr' value='57'/>
      <enumerator name='T_Query' value='58'/>
      <enumerator name='T_TypeName' value='59'/>
      <enumerator name='T_ColumnRef' value='60'/>
      <enumerator name='T_ParamRef' value='61'/>
      <enumerator name='T_A_Expr' value='62'/>
      <enumerator name='T_A_Const' value='63'/>
      <enumerator name='T_TypeCast' value='64'/>
      <enumerator name='T_CollateClause' value='65'/>
      <enumerator name='T_RoleSpec' value='66'/>
      <enumerator name='T_FuncCall' value='67'/>
      <enumerator name='T_A_Star' value='68'/>
      <enumerator name='T_A_Indices' value='69'/>
      <enumerator name='T_A_Indirection' value='70'/>
      <enumerator name='T_A_ArrayExpr' value='71'/>
      <enumerator name='T_ResTarget' value='72'/>
      <enumerator name='T_MultiAssignRef' value='73'/>
      <enumerator name='T_SortBy' value='74'/>
      <enumerator name='T_WindowDef' value='75'/>
      <enumerator name='T_RangeSubselect' value='76'/>
      <enumerator name='T_RangeFunction' value='77'/>
      <enumerator name='T_RangeTableFunc' value='78'/>
      <enumerator name='T_RangeTableFuncCol' value='79'/>
      <enumerator name='T_RangeTableSample' value='80'/>
      <enumerator name='T_ColumnDef' value='81'/>
      <enumerator name='T_TableLikeClause' value='82'/>
      <enumerator name='T_IndexElem' value='83'/>
      <enumerator name='T_DefElem' value='84'/>
      <enumerator name='T_LockingClause' value='85'/>
      <enumerator name='T_XmlSerialize' value='86'/>
      <enumerator name='T_PartitionElem' value='87'/>
      <enumerator name='T_PartitionSpec' value='88'/>
      <enumerator name='T_PartitionBoundSpec' value='89'/>
      <enumerator name='T_PartitionRangeDatum' value='90'/>
      <enumerator name='T_PartitionCmd' value='91'/>
      <enumerator name='T_RangeTblEntry' value='92'/>
      <enumerator name='T_RTEPermissionInfo' value='93'/>
      <enumerator name='T_RangeTblFunction' value='94'/>
      <enumerator name='T_TableSampleClause' value='95'/>
      <enumerator name='T_WithCheckOption' value='96'/>
      <enumerator name='T_SortGroupClause' value='97'/>
      <enumerator name='T_GroupingSet' value='98'/>
      <enumerator name='T_WindowClause' value='99'/>
      <enumerator name='T_RowMarkClause' value='100'/>
      <enumerator name='T_WithClause' value='101'/>
      <enumerator name='T_InferClause' value='102'/>
      <enumerator name='T_OnConflictClause' value='103'/>
      <enumerator name='T_CTESearchClause' value='104'/>
      <enumerator name='T_CTECycleClause' value='105'/>
      <enumerator name='T_CommonTableExpr' value='106'/>
      <enumerator name='T_MergeWhenClause' value='107'/>
      <enumerator name='T_MergeAction' value='108'/>
      <enumerator name='T_TriggerTransition' value='109'/>
      <enumerator name='T_JsonOutput' value='110'/>
      <enumerator name='T_JsonKeyValue' value='111'/>
      <enumerator name='T_JsonParseExpr' value='112'/>
      <enumerator name='T_JsonScalarExpr' value='113'/>
      <enumerator name='T_JsonSerializeExpr' value='114'/>
      <enumerator name='T_JsonObjectConstructor' value='115'/>
      <enumerator name='T_JsonArrayConstructor' value='116'/>
      <enumerator name='T_JsonArrayQueryConstructor' value='117'/>
      <enumerator name='T_JsonAggConstructor' value='118'/>
      <enumerator name='T_JsonObjectAgg' value='119'/>
      <enumerator name='T_JsonArrayAgg' value='120'/>
      <enumerator name='T_RawStmt' value='121'/>
      <enumerator name='T_InsertStmt' value='122'/>
      <enumerator name='T_DeleteStmt' value='123'/>
      <enumerator name='T_UpdateStmt' value='124'/>
      <enumerator name='T_MergeStmt' value='125'/>
      <enumerator name='T_SelectStmt' value='126'/>
      <enumerator name='T_SetOperationStmt' value='127'/>
      <enumerator name='T_ReturnStmt' value='128'/>
      <enumerator name='T_PLAssignStmt' value='129'/>
      <enumerator name='T_CreateSchemaStmt' value='130'/>
      <enumerator name='T_AlterTableStmt' value='131'/>
      <enumerator name='T_ReplicaIdentityStmt' value='132'/>
      <enumerator name='T_AlterTableCmd' value='133'/>
      <enumerator name='T_AlterCollationStmt' value='134'/>
      <enumerator name='T_AlterDomainStmt' value='135'/>
      <enumerator name='T_GrantStmt' value='136'/>
      <enumerator name='T_ObjectWithArgs' value='137'/>
      <enumerator name='T_AccessPriv' value='138'/>
      <enumerator name='T_GrantRoleStmt' value='139'/>
      <enumerator name='T_AlterDefaultPrivilegesStmt' value='140'/>
      <enumerator name='T_CopyStmt' value='141'/>
      <enumerator name='T_VariableSetStmt' value='142'/>
      <enumerator name='T_VariableShowStmt' value='143'/>
      <enumerator name='T_CreateStmt' value='144'/>
      <enumerator name='T_Constraint' value='145'/>
      <enumerator name='T_CreateTableSpaceStmt' value='146'/>
      <enumerator name='T_DropTableSpaceStmt' value='147'/>
      <enumerator name='T_AlterTableSpaceOptionsStmt' value='148'/>
      <enumerator name='T_AlterTableMoveAllStmt' value='149'/>
      <enumerator name='T_CreateExtensionStmt' value='150'/>
      <enumerator name='T_AlterExtensionStmt' value='151'/>
      <enumerator name='T_AlterExtensionContentsStmt' value='152'/>
      <enumerator name='T_CreateFdwStmt' value='153'/>
      <enumerator name='T_AlterFdwStmt' value='154'/>
      <enumerator name='T_CreateForeignServerStmt' value='155'/>
      <enumerator name='T_AlterForeignServerStmt' value='156'/>
      <enumerator name='T_CreateForeignTableStmt' value='157'/>
      <enumerator name='T_CreateUserMappingStmt' value='158'/>
      <enumerator name='T_AlterUserMappingStmt' value='159'/>
      <enumerator name='T_DropUserMappingStmt' value='160'/>
      <enumerator name='T_ImportForeignSchemaStmt' value='161'/>
      <enumerator name='T_CreatePolicyStmt' value='162'/>
      <enumerator name='T_AlterPolicyStmt' value='163'/>
      <enumerator name='T_CreateAmStmt' value='164'/>
      <enumerator name='T_CreateTrigStmt' value='165'/>
      <enumerator name='T_CreateEventTrigStmt' value='166'/>
      <enumerator name='T_AlterEventTrigStmt' value='167'/>
      <enumerator name='T_CreatePLangStmt' value='168'/>
      <enumerator name='T_CreateRoleStmt' value='169'/>
      <enumerator name='T_AlterRoleStmt' value='170'/>
      <enumerator name='T_AlterRoleSetStmt' value='171'/>
      <enumerator name='T_DropRoleStmt' value='172'/>
      <enumerator name='T_CreateSeqStmt' value='173'/>
      <enumerator name='T_AlterSeqStmt' value='174'/>
      <enumerator name='T_DefineStmt' value='175'/>
      <enumerator name='T_CreateDomainStmt' value='176'/>
      <enumerator name='T_CreateOpClassStmt' value='177'/>
      <enumerator name='T_CreateOpClassItem' value='178'/>
      <enumerator name='T_CreateOpFamilyStmt' value='179'/>
      <enumerator name='T_AlterOpFamilyStmt' value='180'/>
      <enumerator name='T_DropStmt' value='181'/>
      <enumerator name='T_TruncateStmt' value='182'/>
      <enumerator name='T_CommentStmt' value='183'/>
      <enumerator name='T_SecLabelStmt' value='184'/>
      <enumerator name='T_DeclareCursorStmt' value='185'/>
      <enumerator name='T_ClosePortalStmt' value='186'/>
      <enumerator name='T_FetchStmt' value='187'/>
      <enumerator name='T_IndexStmt' value='188'/>
      <enumerator name='T_CreateStatsStmt' value='189'/>
      <enumerator name='T_StatsElem' value='190'/>
      <enumerator name='T_AlterStatsStmt' value='191'/>
      <enumerator name='T_CreateFunctionStmt' value='192'/>
      <enumerator name='T_FunctionParameter' value='193'/>
      <enumerator name='T_AlterFunctionStmt' value='194'/>
      <enumerator name='T_DoStmt' value='195'/>
      <enumerator name='T_InlineCodeBlock' value='196'/>
      <enumerator name='T_CallStmt' value='197'/>
      <enumerator name='T_CallContext' value='198'/>
      <enumerator name='T_RenameStmt' value='199'/>
      <enumerator name='T_AlterObjectDependsStmt' value='200'/>
      <enumerator name='T_AlterObjectSchemaStmt' value='201'/>
      <enumerator name='T_AlterOwnerStmt' value='202'/>
      <enumerator name='T_AlterOperatorStmt' value='203'/>
      <enumerator name='T_AlterTypeStmt' value='204'/>
      <enumerator name='T_RuleStmt' value='205'/>
      <enumerator name='T_NotifyStmt' value='206'/>
      <enumerator name='T_ListenStmt' value='207'/>
      <enumerator name='T_UnlistenStmt' value='208'/>
      <enumerator name='T_TransactionStmt' value='209'/>
      <enumerator name='T_CompositeTypeStmt' value='210'/>
      <enumerator name='T_CreateEnumStmt' value='211'/>
      <enumerator name='T_CreateRangeStmt' value='212'/>
      <enumerator name='T_AlterEnumStmt' value='213'/>
      <enumerator name='T_ViewStmt' value='214'/>
      <enumerator name='T_LoadStmt' value='215'/>
      <enumerator name='T_CreatedbStmt' value='216'/>
      <enumerator name='T_AlterDatabaseStmt' value='217'/>
      <enumerator name='T_AlterDatabaseRefreshCollStmt' value='218'/>
      <enumerator name='T_AlterDatabaseSetStmt' value='219'/>
      <enumerator name='T_DropdbStmt' value='220'/>
      <enumerator name='T_AlterSystemStmt' value='221'/>
      <enumerator name='T_ClusterStmt' value='222'/>
      <enumerator name='T_VacuumStmt' value='223'/>
      <enumerator name='T_VacuumRelation' value='224'/>
      <enumerator name='T_ExplainStmt' value='225'/>
      <enumerator name='T_CreateTableAsStmt' value='226'/>
      <enumerator name='T_RefreshMatViewStmt' value='227'/>
      <enumerator name='T_CheckPointStmt' value='228'/>
      <enumerator name='T_DiscardStmt' value='229'/>
      <enumerator name='T_LockStmt' value='230'/>
      <enumerator name='T_ConstraintsSetStmt' value='231'/>
      <enumerator name='T_ReindexStmt' value='232'/>
      <enumerator name='T_CreateConversionStmt' value='233'/>
      <enumerator name='T_CreateCastStmt' value='234'/>
      <enumerator name='T_CreateTransformStmt' value='235'/>
      <enumerator name='T_PrepareStmt' value='236'/>
      <enumerator name='T_ExecuteStmt' value='237'/>
      <enumerator name='T_DeallocateStmt' value='238'/>
      <enumerator name='T_DropOwnedStmt' value='239'/>
      <enumerator name='T_ReassignOwnedStmt' value='240'/>
      <enumerator name='T_AlterTSDictionaryStmt' value='241'/>
      <enumerator name='T_AlterTSConfigurationStmt' value='242'/>
      <enumerator name='T_PublicationTable' value='243'/>
      <enumerator name='T_PublicationObjSpec' value='244'/>
      <enumerator name='T_CreatePublicationStmt' value='245'/>
      <enumerator name='T_AlterPublicationStmt' value='246'/>
      <enumerator name='T_CreateSubscriptionStmt' value='247'/>
      <enumerator name='T_AlterSubscriptionStmt' value='248'/>
      <enumerator name='T_DropSubscriptionStmt' value='249'/>
      <enumerator name='T_PlannerGlobal' value='250'/>
      <enumerator name='T_PlannerInfo' value='251'/>
      <enumerator name='T_RelOptInfo' value='252'/>
      <enumerator name='T_IndexOptInfo' value='253'/>
      <enumerator name='T_ForeignKeyOptInfo' value='254'/>
      <enumerator name='T_StatisticExtInfo' value='255'/>
      <enumerator name='T_JoinDomain' value='256'/>
      <enumerator name='T_EquivalenceClass' value='257'/>
      <enumerator name='T_EquivalenceMember' value='258'/>
      <enumerator name='T_PathKey' value='259'/>
      <enumerator name='T_PathTarget' value='260'/>
      <enumerator name='T_ParamPathInfo' value='261'/>
      <enumerator name='T_Path' value='262'/>
      <enumerator name='T_IndexPath' value='263'/>
      <enumerator name='T_IndexClause' value='264'/>
      <enumerator name='T_BitmapHeapPath' value='265'/>
      <enumerator name='T_BitmapAndPath' value='266'/>
      <enumerator name='T_BitmapOrPath' value='267'/>
      <enumerator name='T_TidPath' value='268'/>
      <enumerator name='T_TidRangePath' value='269'/>
      <enumerator name='T_SubqueryScanPath' value='270'/>
      <enumerator name='T_ForeignPath' value='271'/>
      <enumerator name='T_CustomPath' value='272'/>
      <enumerator name='T_AppendPath' value='273'/>
      <enumerator name='T_MergeAppendPath' value='274'/>
      <enumerator name='T_GroupResultPath' value='275'/>
      <enumerator name='T_MaterialPath' value='276'/>
      <enumerator name='T_MemoizePath' value='277'/>
      <enumerator name='T_UniquePath' value='278'/>
      <enumerator name='T_GatherPath' value='279'/>
      <enumerator name='T_GatherMergePath' value='280'/>
      <enumerator name='T_NestPath' value='281'/>
      <enumerator name='T_MergePath' value='282'/>
      <enumerator name='T_HashPath' value='283'/>
      <enumerator name='T_ProjectionPath' value='284'/>
      <enumerator name='T_ProjectSetPath' value='285'/>
      <enumerator name='T_SortPath' value='286'/>
      <enumerator name='T_IncrementalSortPath' value='287'/>
      <enumerator name='T_GroupPath' value='288'/>
      <enumerator name='T_UpperUniquePath' value='289'/>
      <enumerator name='T_AggPath' value='290'/>
      <enumerator name='T_GroupingSetData' value='291'/>
      <enumerator name='T_RollupData' value='292'/>
      <enumerator name='T_GroupingSetsPath' value='293'/>
      <enumerator name='T_MinMaxAggPath' value='294'/>
      <enumerator name='T_WindowAggPath' value='295'/>
      <enumerator name='T_SetOpPath' value='296'/>
      <enumerator name='T_RecursiveUnionPath' value='297'/>
      <enumerator name='T_LockRowsPath' value='298'/>
      <enumerator name='T_ModifyTablePath' value='299'/>
      <enumerator name='T_LimitPath' value='300'/>
      <enumerator name='T_RestrictInfo' value='301'/>
      <enumerator name='T_PlaceHolderVar' value='302'/>
      <enumerator name='T_SpecialJoinInfo' value='303'/>
      <enumerator name='T_OuterJoinClauseInfo' value='304'/>
      <enumerator name='T_AppendRelInfo' value='305'/>
      <enumerator name='T_RowIdentityVarInfo' value='306'/>
      <enumerator name='T_PlaceHolderInfo' value='307'/>
      <enumerator name='T_MinMaxAggInfo' value='308'/>
      <enumerator name='T_PlannerParamItem' value='309'/>
      <enumerator name='T_AggInfo' value='310'/>
      <enumerator name='T_AggTransInfo' value='311'/>
      <enumerator name='T_UniqueRelInfo' value='312'/>
      <enumerator name='T_PlannedStmt' value='313'/>
      <enumerator name='T_Result' value='314'/>
      <enumerator name='T_ProjectSet' value='315'/>
      <enumerator name='T_ModifyTable' value='316'/>
      <enumerator name='T_Append' value='317'/>
      <enumerator name='T_MergeAppend' value='318'/>
      <enumerator name='T_RecursiveUnion' value='319'/>
      <enumerator name='T_BitmapAnd' value='320'/>
      <enumerator name='T_BitmapOr' value='321'/>
      <enumerator name='T_SeqScan' value='322'/>
      <enumerator name='T_SampleScan' value='323'/>
      <enumerator name='T_IndexScan' value='324'/>
      <enumerator name='T_IndexOnlyScan' value='325'/>
      <enumerator name='T_BitmapIndexScan' value='326'/>
      <enumerator name='T_BitmapHeapScan' value='327'/>
      <enumerator name='T_TidScan' value='328'/>
      <enumerator name='T_TidRangeScan' value='329'/>
      <enumerator name='T_SubqueryScan' value='330'/>
      <enumerator name='T_FunctionScan' value='331'/>
      <enumerator name='T_ValuesScan' value='332'/>
      <enumerator name='T_TableFuncScan' value='333'/>
      <enumerator name='T_CteScan' value='334'/>
      <enumerator name='T_NamedTuplestoreScan' value='335'/>
      <enumerator name='T_WorkTableScan' value='336'/>
      <enumerator name='T_ForeignScan' value='337'/>
      <enumerator name='T_CustomScan' value='338'/>
      <enumerator name='T_NestLoop' value='339'/>
      <enumerator name='T_NestLoopParam' value='340'/>
      <enumerator name='T_MergeJoin' value='341'/>
      <enumerator name='T_HashJoin' value='342'/>
      <enumerator name='T_Material' value='343'/>
      <enumerator name='T_Memoize' value='344'/>
      <enumerator name='T_Sort' value='345'/>
      <enumerator name='T_IncrementalSort' value='346'/>
      <enumerator name='T_Group' value='347'/>
      <enumerator name='T_Agg' value='348'/>
      <enumerator name='T_WindowAgg' value='349'/>
      <enumerator name='T_Unique' value='350'/>
      <enumerator name='T_Gather' value='351'/>
      <enumerator name='T_GatherMerge' value='352'/>
      <enumerator name='T_Hash' value='353'/>
      <enumerator name='T_SetOp' value='354'/>
      <enumerator name='T_LockRows' value='355'/>
      <enumerator name='T_Limit' value='356'/>
      <enumerator name='T_PlanRowMark' value='357'/>
      <enumerator name='T_PartitionPruneInfo' value='358'/>
      <enumerator name='T_PartitionedRelPruneInfo' value='359'/>
      <enumerator name='T_PartitionPruneStepOp' value='360'/>
      <enumerator name='T_PartitionPruneStepCombine' value='361'/>
      <enumerator name='T_PlanInvalItem' value='362'/>
      <enumerator name='T_ExprState' value='363'/>
      <enumerator name='T_IndexInfo' value='364'/>
      <enumerator name='T_ExprContext' value='365'/>
      <enumerator name='T_ReturnSetInfo' value='366'/>
      <enumerator name='T_ProjectionInfo' value='367'/>
      <enumerator name='T_JunkFilter' value='368'/>
      <enumerator name='T_OnConflictSetState' value='369'/>
      <enumerator name='T_MergeActionState' value='370'/>
      <enumerator name='T_ResultRelInfo' value='371'/>
      <enumerator name='T_EState' value='372'/>
      <enumerator name='T_WindowFuncExprState' value='373'/>
      <enumerator name='T_SetExprState' value='374'/>
      <enumerator name='T_SubPlanState' value='375'/>
      <enumerator name='T_DomainConstraintState' value='376'/>
      <enumerator name='T_ResultState' value='377'/>
      <enumerator name='T_ProjectSetState' value='378'/>
      <enumerator name='T_ModifyTableState' value='379'/>
      <enumerator name='T_AppendState' value='380'/>
      <enumerator name='T_MergeAppendState' value='381'/>
      <enumerator name='T_RecursiveUnionState' value='382'/>
      <enumerator name='T_BitmapAndState' value='383'/>
      <enumerator name='T_BitmapOrState' value='384'/>
      <enumerator name='T_ScanState' value='385'/>
      <enumerator name='T_SeqScanState' value='386'/>
      <enumerator name='T_SampleScanState' value='387'/>
      <enumerator name='T_IndexScanState' value='388'/>
      <enumerator name='T_IndexOnlyScanState' value='389'/>
      <enumerator name='T_BitmapIndexScanState' value='390'/>
      <enumerator name='T_BitmapHeapScanState' value='391'/>
      <enumerator name='T_TidScanState' value='392'/>
      <enumerator name='T_TidRangeScanState' value='393'/>
      <enumerator name='T_SubqueryScanState' value='394'/>
      <enumerator name='T_FunctionScanState' value='395'/>
      <enumerator name='T_ValuesScanState' value='396'/>
      <enumerator name='T_TableFuncScanState' value='397'/>
      <enumerator name='T_CteScanState' value='398'/>
      <enumerator name='T_NamedTuplestoreScanState' value='399'/>
      <enumerator name='T_WorkTableScanState' value='400'/>
      <enumerator name='T_ForeignScanState' value='401'/>
      <enumerator name='T_CustomScanState' value='402'/>
      <enumerator name='T_JoinState' value='403'/>
      <enumerator name='T_NestLoopState' value='404'/>
      <enumerator name='T_MergeJoinState' value='405'/>
      <enumerator name='T_HashJoinState' value='406'/>
      <enumerator name='T_MaterialState' value='407'/>
      <enumerator name='T_MemoizeState' value='408'/>
      <enumerator name='T_SortState' value='409'/>
      <enumerator name='T_IncrementalSortState' value='410'/>
      <enumerator name='T_GroupState' value='411'/>
      <enumerator name='T_AggState' value='412'/>
      <enumerator name='T_WindowAggState' value='413'/>
      <enumerator name='T_UniqueState' value='414'/>
      <enumerator name='T_GatherState' value='415'/>
      <enumerator name='T_GatherMergeState' value='416'/>
      <enumerator name='T_HashState' value='417'/>
      <enumerator name='T_SetOpState' value='418'/>
      <enumerator name='T_LockRowsState' value='419'/>
      <enumerator name='T_LimitState' value='420'/>
      <enumerator name='T_IndexAmRoutine' value='421'/>
      <enumerator name='T_TableAmRoutine' value='422'/>
      <enumerator name='T_TsmRoutine' value='423'/>
      <enumerator name='T_EventTriggerData' value='424'/>
      <enumerator name='T_TriggerData' value='425'/>
      <enumerator name='T_TupleTableSlot' value='426'/>
      <enumerator name='T_FdwRoutine' value='427'/>
      <enumerator name='T_Bitmapset' value='428'/>
      <enumerator name='T_ExtensibleNode' value='429'/>
      <enumerator name='T_ErrorSaveContext' value='430'/>
      <enumerator name='T_IdentifySystemCmd' value='431'/>
      <enumerator name='T_BaseBackupCmd' value='432'/>
      <enumerator name='T_CreateReplicationSlotCmd' value='433'/>
      <enumerator name='T_DropReplicationSlotCmd' value='434'/>
      <enumerator name='T_StartReplicationCmd' value='435'/>
      <enumerator name='T_ReadReplicationSlotCmd' value='436'/>
      <enumerator name='T_TimeLineHistoryCmd' value='437'/>
      <enumerator name='T_SupportRequestSimplify' value='438'/>
      <enumerator name='T_SupportRequestSelectivity' value='439'/>
      <enumerator name='T_SupportRequestCost' value='440'/>
      <enumerator name='T_SupportRequestRows' value='441'/>
      <enumerator name='T_SupportRequestIndexCondition' value='442'/>
      <enumerator name='T_SupportRequestWFuncMonotonic' value='443'/>
      <enumerator name='T_SupportRequestOptimizeWindowClause' value='444'/>
      <enumerator name='T_Integer' value='445'/>
      <enumerator name='T_Float' value='446'/>
      <enumerator name='T_Boolean' value='447'/>
      <enumerator name='T_String' value='448'/>
      <enumerator name='T_BitString' value='449'/>
      <enumerator name='T_ForeignKeyCacheInfo' value='450'/>
      <enumerator name='T_IntList' value='451'/>
      <enumerator name='T_OidList' value='452'/>
      <enumerator name='T_XidList' value='453'/>
      <enumerator name='T_AllocSetContext' value='454'/>
      <enumerator name='T_GenerationContext' value='455'/>
      <enumerator name='T_SlabContext' value='456'/>
      <enumerator name='T_TIDBitmap' value='457'/>
      <enumerator name='T_WindowObjectData' value='458'/>
    </enum-decl>
    <enum-decl name='PLpgSQL_datum_type' id='75857318'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_DTYPE_VAR' value='0'/>
      <enumerator name='PLPGSQL_DTYPE_ROW' value='1'/>
      <enumerator name='PLPGSQL_DTYPE_REC' value='2'/>
      <enumerator name='PLPGSQL_DTYPE_RECFIELD' value='3'/>
      <enumerator name='PLPGSQL_DTYPE_PROMISE' value='4'/>
    </enum-decl>
    <enum-decl name='PLpgSQL_resolve_option' id='6587f404'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_RESOLVE_ERROR' value='0'/>
      <enumerator name='PLPGSQL_RESOLVE_VARIABLE' value='1'/>
      <enumerator name='PLPGSQL_RESOLVE_COLUMN' value='2'/>
    </enum-decl>
    <enum-decl name='PLpgSQL_trigtype' id='7a8f9736'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_DML_TRIGGER' value='0'/>
      <enumerator name='PLPGSQL_EVENT_TRIGGER' value='1'/>
      <enumerator name='PLPGSQL_NOT_TRIGGER' value='2'/>
    </enum-decl>
    <enum-decl name='ParseExprKind' id='6578095e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='EXPR_KIND_NONE' value='0'/>
      <enumerator name='EXPR_KIND_OTHER' value='1'/>
      <enumerator name='EXPR_KIND_JOIN_ON' value='2'/>
      <enumerator name='EXPR_KIND_JOIN_USING' value='3'/>
      <enumerator name='EXPR_KIND_FROM_SUBSELECT' value='4'/>
      <enumerator name='EXPR_KIND_FROM_FUNCTION' value='5'/>
      <enumerator name='EXPR_KIND_WHERE' value='6'/>
      <enumerator name='EXPR_KIND_HAVING' value='7'/>
      <enumerator name='EXPR_KIND_FILTER' value='8'/>
      <enumerator name='EXPR_KIND_WINDOW_PARTITION' value='9'/>
      <enumerator name='EXPR_KIND_WINDOW_ORDER' value='10'/>
      <enumerator name='EXPR_KIND_WINDOW_FRAME_RANGE' value='11'/>
      <enumerator name='EXPR_KIND_WINDOW_FRAME_ROWS' value='12'/>
      <enumerator name='EXPR_KIND_WINDOW_FRAME_GROUPS' value='13'/>
      <enumerator name='EXPR_KIND_SELECT_TARGET' value='14'/>
      <enumerator name='EXPR_KIND_INSERT_TARGET' value='15'/>
      <enumerator name='EXPR_KIND_UPDATE_SOURCE' value='16'/>
      <enumerator name='EXPR_KIND_UPDATE_TARGET' value='17'/>
      <enumerator name='EXPR_KIND_MERGE_WHEN' value='18'/>
      <enumerator name='EXPR_KIND_GROUP_BY' value='19'/>
      <enumerator name='EXPR_KIND_ORDER_BY' value='20'/>
      <enumerator name='EXPR_KIND_DISTINCT_ON' value='21'/>
      <enumerator name='EXPR_KIND_LIMIT' value='22'/>
      <enumerator name='EXPR_KIND_OFFSET' value='23'/>
      <enumerator name='EXPR_KIND_RETURNING' value='24'/>
      <enumerator name='EXPR_KIND_VALUES' value='25'/>
      <enumerator name='EXPR_KIND_VALUES_SINGLE' value='26'/>
      <enumerator name='EXPR_KIND_CHECK_CONSTRAINT' value='27'/>
      <enumerator name='EXPR_KIND_DOMAIN_CHECK' value='28'/>
      <enumerator name='EXPR_KIND_COLUMN_DEFAULT' value='29'/>
      <enumerator name='EXPR_KIND_FUNCTION_DEFAULT' value='30'/>
      <enumerator name='EXPR_KIND_INDEX_EXPRESSION' value='31'/>
      <enumerator name='EXPR_KIND_INDEX_PREDICATE' value='32'/>
      <enumerator name='EXPR_KIND_STATS_EXPRESSION' value='33'/>
      <enumerator name='EXPR_KIND_ALTER_COL_TRANSFORM' value='34'/>
      <enumerator name='EXPR_KIND_EXECUTE_PARAMETER' value='35'/>
      <enumerator name='EXPR_KIND_TRIGGER_WHEN' value='36'/>
      <enumerator name='EXPR_KIND_POLICY' value='37'/>
      <enumerator name='EXPR_KIND_PARTITION_BOUND' value='38'/>
      <enumerator name='EXPR_KIND_PARTITION_EXPRESSION' value='39'/>
      <enumerator name='EXPR_KIND_CALL_ARGUMENT' value='40'/>
      <enumerator name='EXPR_KIND_COPY_WHERE' value='41'/>
      <enumerator name='EXPR_KIND_GENERATED_COLUMN' value='42'/>
      <enumerator name='EXPR_KIND_CYCLE_MARK' value='43'/>
    </enum-decl>
    <enum-decl name='RowMarkType' id='c13ee7d5'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ROW_MARK_EXCLUSIVE' value='0'/>
      <enumerator name='ROW_MARK_NOKEYEXCLUSIVE' value='1'/>
      <enumerator name='ROW_MARK_SHARE' value='2'/>
      <enumerator name='ROW_MARK_KEYSHARE' value='3'/>
      <enumerator name='ROW_MARK_REFERENCE' value='4'/>
      <enumerator name='ROW_MARK_COPY' value='5'/>
    </enum-decl>
    <enum-decl name='ScanDirection' id='b25f871e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BackwardScanDirection' value='-1'/>
      <enumerator name='NoMovementScanDirection' value='0'/>
      <enumerator name='ForwardScanDirection' value='1'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='08f5ca17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='RAW_PARSE_DEFAULT' value='0'/>
      <enumerator name='RAW_PARSE_TYPE_NAME' value='1'/>
      <enumerator name='RAW_PARSE_PLPGSQL_EXPR' value='2'/>
      <enumerator name='RAW_PARSE_PLPGSQL_ASSIGN1' value='3'/>
      <enumerator name='RAW_PARSE_PLPGSQL_ASSIGN2' value='4'/>
      <enumerator name='RAW_PARSE_PLPGSQL_ASSIGN3' value='5'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='40ed39d2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SFRM_ValuePerCall' value='1'/>
      <enumerator name='SFRM_Materialize' value='2'/>
      <enumerator name='SFRM_Materialize_Random' value='4'/>
      <enumerator name='SFRM_Materialize_Preferred' value='8'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='3fed383f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ExprSingleResult' value='0'/>
      <enumerator name='ExprMultipleResult' value='1'/>
      <enumerator name='ExprEndResult' value='2'/>
    </enum-decl>
    <class-decl name='CachedPlan' size-in-bits='384' is-struct='yes' visibility='default' id='421dd424'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='magic' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stmt_list' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_oneshot' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='is_saved' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='is_valid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='planRoleId' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dependsOnRole' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='saved_xmin' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generation' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='refcount' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='context' type-id='9968f2f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='CopyMultiInsertBuffer' is-struct='yes' visibility='default' is-declaration-only='yes' id='daee8f6e'/>
    <class-decl name='ExprContext_CB' size-in-bits='192' is-struct='yes' visibility='default' id='7cf0472b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='4b1e905c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='function' type-id='a8df8ac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='arg' type-id='f24b0a4f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprEvalStep' size-in-bits='512' is-struct='yes' visibility='default' id='d3b295aa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='33dbba72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resvalue' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d' type-id='7f139c63' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='FdwRoutine' is-struct='yes' visibility='default' is-declaration-only='yes' id='870496e8'/>
    <class-decl name='IndexAmRoutine' is-struct='yes' visibility='default' is-declaration-only='yes' id='0fa0ca0f'/>
    <class-decl name='ItemPointerData' size-in-bits='48' is-struct='yes' visibility='default' id='9dcce3ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ip_blkid' type-id='dbac37a8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ip_posid' type-id='12f12c16' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='JitContext' is-struct='yes' visibility='default' is-declaration-only='yes' id='67f61e43'/>
    <class-decl name='JitInstrumentation' is-struct='yes' visibility='default' is-declaration-only='yes' id='adb8d8aa'/>
    <class-decl name='LockInfoData' size-in-bits='64' is-struct='yes' visibility='default' id='746df812'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lockRelId' type-id='499d55b7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='Node' size-in-bits='32' is-struct='yes' visibility='default' id='717e4c75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_nsitem' size-in-bits='128' is-struct='yes' visibility='default' id='a47fdee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='itemtype' type-id='179a0329' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='itemno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='f0068755' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='e84913bd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='Param' size-in-bits='224' is-struct='yes' visibility='default' id='24900a7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xpr' type-id='c0a129cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='paramkind' type-id='7a947a9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paramid' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='paramtype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='paramtypmod' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='paramcollid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='location' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PgStat_TableStatus' is-struct='yes' visibility='default' is-declaration-only='yes' id='7e3f796b'/>
    <class-decl name='Plan' size-in-bits='832' is-struct='yes' visibility='default' id='58a10fda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='startup_cost' type-id='46a85fb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='total_cost' type-id='46a85fb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='plan_rows' type-id='2206bd64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='plan_width' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='parallel_aware' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='parallel_safe' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='async_capable' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='plan_node_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='targetlist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='qual' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lefttree' type-id='5fc51fc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='righttree' type-id='5fc51fc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='initPlan' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='extParam' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='allParam' type-id='e8c55cbc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='RelFileLocator' size-in-bits='96' is-struct='yes' visibility='default' id='99549310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spcOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dbOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='relNumber' type-id='58e4ef28' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='RowSecurityDesc' is-struct='yes' visibility='default' is-declaration-only='yes' id='09e09440'/>
    <class-decl name='SharedJitInstrumentation' is-struct='yes' visibility='default' is-declaration-only='yes' id='94925cc3'/>
    <class-decl name='dsa_area' is-struct='yes' visibility='default' is-declaration-only='yes' id='255914cd'/>
    <typedef-decl name='Bitmapset' type-id='fef0ef96' id='d0a434ed'/>
    <typedef-decl name='CachedPlanSource' type-id='376258c1' id='86833f90'/>
    <typedef-decl name='CommonTableExpr' type-id='83628fe7' id='d52d60c4'/>
    <pointer-type-def type-id='73f0e738' size-in-bits='64' id='1759c1b2'/>
    <typedef-decl name='ErrorData' type-id='2530e949' id='a0fdc2ea'/>
    <typedef-decl name='EventTriggerData' type-id='06d66699' id='c23f55f0'/>
    <typedef-decl name='Expr' type-id='46fc0fe6' id='c0a129cb'/>
    <typedef-decl name='HTAB' type-id='d3f73eb6' id='09c852cb'/>
    <typedef-decl name='HeapTupleHeader' type-id='a537715c' id='0dfa8919'/>
    <typedef-decl name='Instrumentation' type-id='e19aae85' id='25f39bce'/>
    <typedef-decl name='JunkFilter' type-id='fa34ef4d' id='512b66a8'/>
    <typedef-decl name='List' type-id='6852ba09' id='db0045d4'/>
    <typedef-decl name='NullableDatum' type-id='e2d57367' id='73f7fd18'/>
    <typedef-decl name='PGFunction' type-id='050f9711' id='bf77460d'/>
    <typedef-decl name='PLpgSQL_func_hashkey' type-id='66941e67' id='c32716ea'/>
    <typedef-decl name='PLpgSQL_stmt' type-id='839ee38b' id='79e2ce06'/>
    <typedef-decl name='PLpgSQL_stmt_block' type-id='b3b83075' id='f9084154'/>
    <typedef-decl name='PLpgSQL_type' type-id='e8226b2d' id='c5027e70'/>
    <typedef-decl name='ParamExecData' type-id='8889a5cf' id='ec58a07c'/>
    <typedef-decl name='ParseNamespaceItem' type-id='9a7c918c' id='2167e055'/>
    <typedef-decl name='ParseState' type-id='aeb1887a' id='37a337dc'/>
    <typedef-decl name='PlannedStmt' type-id='cdab5403' id='a0780334'/>
    <typedef-decl name='PublicationDesc' type-id='aca4dc30' id='03d04117'/>
    <typedef-decl name='QueryEnvironment' type-id='1e791674' id='7345a329'/>
    <typedef-decl name='RegProcedure' type-id='de491152' id='e59e47cf'/>
    <typedef-decl name='RuleLock' type-id='e0e44ec4' id='fa5e6a1d'/>
    <typedef-decl name='SPITupleTable' type-id='2c07bdfb' id='b46b9160'/>
    <typedef-decl name='Trigger' type-id='ee64d34b' id='fd4d0dd0'/>
    <typedef-decl name='TriggerDesc' type-id='e97a37c6' id='1b2f0781'/>
    <typedef-decl name='TupleConversionMap' type-id='794d0e85' id='e434b0a4'/>
    <typedef-decl name='TupleTableSlot' type-id='05215b1f' id='1f0b318a'/>
    <typedef-decl name='Tuplestorestate' type-id='ffe56677' id='8b7bc69c'/>
    <typedef-decl name='TypeName' type-id='e1d79126' id='d1d2d2bf'/>
    <typedef-decl name='WorkerInstrumentation' type-id='601c3a93' id='d39d25d0'/>
    <typedef-decl name='bytea' type-id='24428564' id='0fb10f85'/>
    <typedef-decl name='int16' type-id='a2185560' id='27de9c2e'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <typedef-decl name='uint16' type-id='8efea9e5' id='06a3df2b'/>
    <typedef-decl name='uint32' type-id='f0981eeb' id='7aa912f5'/>
    <typedef-decl name='uintptr_t' type-id='7359adad' id='e475ab95'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <pointer-type-def type-id='7cf0472b' size-in-bits='64' id='4b1e905c'/>
    <pointer-type-def type-id='03f6d8e9' size-in-bits='64' id='a537715c'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='infinite' id='e84913bd'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <class-decl name='Bitmapset' size-in-bits='64' is-struct='yes' visibility='default' id='fef0ef96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nwords' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='words' type-id='0e160242' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='CachedPlanSource' size-in-bits='1600' is-struct='yes' visibility='default' id='376258c1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='magic' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='raw_parse_tree' type-id='563110bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='query_string' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='commandTag' type-id='a18bc913' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='param_types' type-id='42f3594b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_params' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='parserSetup' type-id='df87ed5b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='parserSetupArg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cursor_options' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='fixed_result' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='resultDesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='context' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='query_list' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='relationOids' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='invalItems' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='search_path' type-id='2f13296e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='query_context' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rewriteRoleId' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='rewriteRowSecurity' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1064'>
        <var-decl name='dependsOnRLS' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='gplan' type-id='da707eb2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='is_oneshot' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1160'>
        <var-decl name='is_complete' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='is_saved' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1176'>
        <var-decl name='is_valid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='generation' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='node' type-id='7ec7d215' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='generic_cost' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='total_custom_cost' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='num_custom_plans' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='num_generic_plans' type-id='27dc5d97' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='CommonTableExpr' size-in-bits='832' is-struct='yes' visibility='default' id='83628fe7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctename' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aliascolnames' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctematerialized' type-id='c0bf5007' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctequery' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='search_clause' type-id='ff83265a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cycle_clause' type-id='3a14ea32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='location' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cterecursive' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cterefcount' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ctecolnames' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ctecoltypes' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctecoltypmods' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctecolcollations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ErrorData' size-in-bits='1472' is-struct='yes' visibility='default' id='2530e949'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elevel' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='output_to_server' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='output_to_client' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='hide_stmt' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='hide_ctx' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lineno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='funcname' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='domain' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='context_domain' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sqlerrcode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='message' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='detail' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='detail_log' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='hint' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='context' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='backtrace' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='message_id' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='schema_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='table_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='column_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='datatype_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='constraint_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='cursorpos' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='internalpos' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='internalquery' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='saved_errno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='assoc_context' type-id='34bdb839' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='EventTriggerData' size-in-bits='256' is-struct='yes' visibility='default' id='06d66699'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='event' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='parsetree' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tag' type-id='a18bc913' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='Expr' size-in-bits='32' is-struct='yes' visibility='default' id='46fc0fe6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='HTAB' is-struct='yes' visibility='default' is-declaration-only='yes' id='d3f73eb6'/>
    <class-decl name='Instrumentation' size-in-bits='3200' is-struct='yes' visibility='default' id='e19aae85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='need_timer' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='need_bufusage' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='need_walusage' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='async_mode' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='running' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='starttime' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='counter' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='firsttuple' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tuplecount' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufusage_start' type-id='bec09531' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='walusage_start' type-id='cb65ae2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='startup' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='total' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ntuples' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='ntuples2' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nloops' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nfiltered1' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nfiltered2' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='bufusage' type-id='bec09531' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='walusage' type-id='cb65ae2b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='JunkFilter' size-in-bits='320' is-struct='yes' visibility='default' id='fa34ef4d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='jf_targetList' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='jf_cleanTupType' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='jf_cleanMap' type-id='f205808f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='jf_resultSlot' type-id='336f4727' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='List' size-in-bits='192' is-struct='yes' visibility='default' id='6852ba09'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='length' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_length' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='elements' type-id='ac606329' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initial_elements' type-id='93433141' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='MemoryContextData' size-in-bits='640' is-struct='yes' visibility='default' id='60ea65f1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isReset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='allowInCritSection' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mem_allocated' type-id='305ff205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='methods' type-id='207065e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parent' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='firstchild' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prevchild' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nextchild' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ident' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reset_cbs' type-id='ce502280' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='NullableDatum' size-in-bits='128' is-struct='yes' visibility='default' id='e2d57367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isnull' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_func_hashkey' size-in-bits='3328' is-struct='yes' visibility='default' id='66941e67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='funcOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isTrigger' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='isEventTrigger' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trigOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='inputCollation' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='argtypes' type-id='6b765c6a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_stmt' size-in-bits='96' is-struct='yes' visibility='default' id='839ee38b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd_type' type-id='75f63103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lineno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stmtid' type-id='f0981eeb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_stmt_block' size-in-bits='448' is-struct='yes' visibility='default' id='b3b83075'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd_type' type-id='75f63103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lineno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stmtid' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='label' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='body' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_initvars' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='initvarnos' type-id='7292109c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='exceptions' type-id='15a18f82' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_type' size-in-bits='448' is-struct='yes' visibility='default' id='e8226b2d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='typname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='typoid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ttype' type-id='736dc355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='typlen' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='typbyval' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='typtype' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='collation' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='typisarray' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='atttypmod' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='origtypname' type-id='9ec4c26c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tcache' type-id='aa8b2ff3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tupdesc_id' type-id='f69d0a36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ParamExecData' size-in-bits='192' is-struct='yes' visibility='default' id='8889a5cf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='execPlan' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='isnull' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ParamListInfoData' size-in-bits='512' is-struct='yes' visibility='default' id='e1501ec6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='paramFetch' type-id='a3de2d94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paramFetchArg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='paramCompile' type-id='b831bad1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='paramCompileArg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='parserSetup' type-id='df87ed5b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='parserSetupArg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='paramValuesStr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='numParams' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='params' type-id='4f1256a8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ParseNamespaceItem' size-in-bits='384' is-struct='yes' visibility='default' id='9a7c918c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_names' type-id='c6b151e7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_rte' type-id='0e6ce0d6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_rtindex' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_perminfo' type-id='8768804d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_nscolumns' type-id='f18806f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_rel_visible' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='p_cols_visible' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='p_lateral_only' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='p_lateral_ok' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ParseState' size-in-bits='1792' is-struct='yes' visibility='default' id='aeb1887a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parentParseState' type-id='63c837a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_sourcetext' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_rtable' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_rteperminfos' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_joinexprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_nullingrels' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_joinlist' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='p_namespace' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='p_lateral_active' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='p_ctenamespace' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='p_future_ctes' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='p_parent_cte' type-id='8c1a5c4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='p_target_relation' type-id='c79d68a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='p_target_nsitem' type-id='6883c46a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='p_is_insert' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='p_windowdefs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='p_expr_kind' type-id='168841d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='p_next_resno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='p_multiassign_exprs' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='p_locking_clause' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='p_locked_from_parent' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1224'>
        <var-decl name='p_resolve_unknowns' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='p_queryEnv' type-id='74ab5782' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='p_hasAggs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1352'>
        <var-decl name='p_hasWindowFuncs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='p_hasTargetSRFs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1368'>
        <var-decl name='p_hasSubLinks' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='p_hasModifyingCTE' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='p_last_srf' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='p_pre_columnref_hook' type-id='c6ea5968' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='p_post_columnref_hook' type-id='4afcb79b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='p_paramref_hook' type-id='2fc99baa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='p_coerce_param_hook' type-id='c4d0a731' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='p_ref_hook_state' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PartitionDescData' is-struct='yes' visibility='default' is-declaration-only='yes' id='6678ac94'/>
    <class-decl name='PartitionDirectoryData' is-struct='yes' visibility='default' is-declaration-only='yes' id='9cf45a44'/>
    <class-decl name='PartitionKeyData' is-struct='yes' visibility='default' is-declaration-only='yes' id='d3523890'/>
    <class-decl name='PlannedStmt' size-in-bits='1088' is-struct='yes' visibility='default' id='cdab5403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='commandType' type-id='af8a0214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='queryId' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hasReturning' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='hasModifyingCTE' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='canSetTag' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='transientPlan' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dependsOnRole' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='parallelModeNeeded' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='jitFlags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='planTree' type-id='5fc51fc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rtable' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='permInfos' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='resultRelations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='appendRelations' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='subplans' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rewindPlanIDs' type-id='e8c55cbc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rowMarks' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='relationOids' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='invalItems' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='paramExecTypes' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='utilityStmt' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='stmt_location' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='stmt_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PublicationDesc' size-in-bits='64' is-struct='yes' visibility='default' id='aca4dc30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubactions' type-id='ae282a3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rf_valid_for_update' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='rf_valid_for_delete' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cols_valid_for_update' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='cols_valid_for_delete' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='QueryEnvironment' is-struct='yes' visibility='default' is-declaration-only='yes' id='1e791674'/>
    <class-decl name='ResourceOwnerData' is-struct='yes' visibility='default' is-declaration-only='yes' id='d301d814'/>
    <class-decl name='RuleLock' size-in-bits='128' is-struct='yes' visibility='default' id='e0e44ec4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numLocks' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rules' type-id='50db0561' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='SMgrRelationData' size-in-bits='896' is-struct='yes' visibility='default' id='bcdd7f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smgr_rlocator' type-id='24ad344f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='smgr_owner' type-id='390a8674' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='smgr_targblock' type-id='3db40640' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='smgr_cached_nblocks' type-id='0403c23f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='smgr_which' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='md_num_open_segs' type-id='2020bac4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='md_seg_fds' type-id='2d63c7ed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='node' type-id='7ec7d215' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='SPITupleTable' size-in-bits='448' is-struct='yes' visibility='default' id='2c07bdfb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tupdesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vals' type-id='4fc4ab07' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='numvals' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='alloced' type-id='f69d0a36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tuptabcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='f13aab3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='subid' type-id='5f59ae47' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='SnapshotData' size-in-bits='960' is-struct='yes' visibility='default' id='8b267665'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='snapshot_type' type-id='92c892a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='xmin' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='xmax' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xip' type-id='b1ef65cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='xcnt' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='subxip' type-id='b1ef65cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='subxcnt' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='suboverflowed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='takenDuringRecovery' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='copied' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='curcid' type-id='6692fd60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='speculativeToken' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vistest' type-id='8b7497cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='active_count' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='regd_count' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ph_node' type-id='e72a9a83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='whenTaken' type-id='7448fdb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lsn' type-id='cdb01e8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='snapXactCompletionCount' type-id='f69d0a36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TableAmRoutine' size-in-bits='2944' is-struct='yes' visibility='default' id='9351f42b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='slot_callbacks' type-id='5a87d566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scan_begin' type-id='12479770' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scan_end' type-id='5c77fa5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='scan_rescan' type-id='158a83bf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='scan_getnextslot' type-id='ec4735d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='scan_set_tidrange' type-id='6da8c08f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='scan_getnextslot_tidrange' type-id='ec4735d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='parallelscan_estimate' type-id='11c65a0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='parallelscan_initialize' type-id='d773ab59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='parallelscan_reinitialize' type-id='4c8fbedb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='index_fetch_begin' type-id='b2f50009' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='index_fetch_reset' type-id='85893be2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='index_fetch_end' type-id='85893be2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='index_fetch_tuple' type-id='5760624e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tuple_fetch_row_version' type-id='8e09e859' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tuple_tid_valid' type-id='7a5010f0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tuple_get_latest_tid' type-id='3eaabdfa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tuple_satisfies_snapshot' type-id='5b219226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='index_delete_tuples' type-id='d2aca269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tuple_insert' type-id='5a898ed9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tuple_insert_speculative' type-id='ef6a1459' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tuple_complete_speculative' type-id='97ed04e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='multi_insert' type-id='c1be146e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tuple_delete' type-id='70dac445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tuple_update' type-id='0cf7ee5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tuple_lock' type-id='c734c22b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='finish_bulk_insert' type-id='1ff7fe08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='relation_set_new_filelocator' type-id='ca493d20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='relation_nontransactional_truncate' type-id='f2b1da41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='relation_copy_data' type-id='e01d8093' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='relation_copy_for_cluster' type-id='d6174351' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='relation_vacuum' type-id='2b3b1f1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='scan_analyze_next_block' type-id='25d4612c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='scan_analyze_next_tuple' type-id='bee3d46f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='index_build_range_scan' type-id='8f3c25ba' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='index_validate_scan' type-id='2931a6a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='relation_size' type-id='0feda258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='relation_needs_toast_table' type-id='2cb8ed83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='relation_toast_am' type-id='dca928c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='relation_fetch_toast_slice' type-id='5eda35ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='relation_estimate_size' type-id='74ff6c8f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='scan_bitmap_next_block' type-id='4a75c639' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='scan_bitmap_next_tuple' type-id='0f772ba5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='scan_sample_next_block' type-id='4d721265' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='scan_sample_next_tuple' type-id='07848f31' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='Trigger' size-in-bits='704' is-struct='yes' visibility='default' id='ee64d34b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tgoid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tgname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tgfoid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tgtype' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='tgenabled' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='tgisinternal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tgisclone' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tgconstrrelid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tgconstrindid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tgconstraint' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tgdeferrable' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='tginitdeferred' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='tgnargs' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tgnattr' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tgattr' type-id='660e0121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tgargs' type-id='9b23c9ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tgqual' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tgoldtable' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tgnewtable' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TriggerDesc' size-in-bits='320' is-struct='yes' visibility='default' id='e97a37c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='triggers' type-id='b8734eab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numtriggers' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='trig_insert_before_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='trig_insert_after_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='trig_insert_instead_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='trig_insert_before_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='trig_insert_after_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='trig_update_before_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='trig_update_after_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='trig_update_instead_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='trig_update_before_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='trig_update_after_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='trig_delete_before_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='trig_delete_after_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='trig_delete_instead_row' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='trig_delete_before_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='trig_delete_after_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='trig_truncate_before_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='trig_truncate_after_statement' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='trig_insert_new_table' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='trig_update_old_table' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='trig_update_new_table' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trig_delete_old_table' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TupleConversionMap' size-in-bits='448' is-struct='yes' visibility='default' id='794d0e85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='indesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='outdesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attrMap' type-id='042f5542' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='invalues' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='inisnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='outvalues' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='outisnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TupleDescData' size-in-bits='192' is-struct='yes' visibility='default' id='e053624c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='natts' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tdtypeid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tdtypmod' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tdrefcount' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='constr' type-id='f0d64c54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='attrs' type-id='3f6b39ca' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TupleTableSlot' size-in-bits='512' is-struct='yes' visibility='default' id='05215b1f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tts_flags' type-id='06a3df2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='tts_nvalid' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tts_ops' type-id='4c122643' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tts_tupleDescriptor' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tts_values' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tts_isnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tts_mcxt' type-id='9968f2f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tts_tid' type-id='f228c910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tts_tableOid' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='Tuplestorestate' is-struct='yes' visibility='default' is-declaration-only='yes' id='ffe56677'/>
    <class-decl name='TypeName' size-in-bits='448' is-struct='yes' visibility='default' id='e1d79126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='names' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='typeOid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='setof' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='pct_type' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='typmods' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='typemod' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='arrayBounds' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='location' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='WorkerInstrumentation' size-in-bits='64' is-struct='yes' visibility='default' id='601c3a93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_workers' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='instrument' type-id='b1f0fafd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_SPI_plan' is-struct='yes' visibility='default' is-declaration-only='yes' id='a8e0f606'/>
    <class-decl name='varlena' size-in-bits='32' is-struct='yes' visibility='default' id='24428564'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vl_len_' type-id='8e0573fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vl_dat' type-id='e84913bd' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='BlockIdData' type-id='2869d54f' id='dbac37a8'/>
    <typedef-decl name='Cardinality' type-id='a0eb0f08' id='2206bd64'/>
    <typedef-decl name='Cost' type-id='a0eb0f08' id='46a85fb1'/>
    <pointer-type-def type-id='59c8bafd' size-in-bits='64' id='050f9711'/>
    <typedef-decl name='ExprContextCallbackFunction' type-id='49a7cf56' id='a8df8ac9'/>
    <typedef-decl name='FormData_pg_class' type-id='2bc808b6' id='cf1c8d75'/>
    <typedef-decl name='FormData_pg_index' type-id='9c8bb25a' id='4d9fe359'/>
    <typedef-decl name='HeapTupleData' type-id='07fb1a17' id='e5c4cc54'/>
    <typedef-decl name='LockRelId' type-id='0738d104' id='499d55b7'/>
    <typedef-decl name='OffsetNumber' type-id='06a3df2b' id='12f12c16'/>
    <typedef-decl name='PLpgSQL_datum' type-id='4ecb5a4c' id='d86ba563'/>
    <typedef-decl name='PLpgSQL_nsitem_type' type-id='7a61f31d' id='179a0329'/>
    <typedef-decl name='ParamKind' type-id='410f5d6f' id='7a947a9b'/>
    <typedef-decl name='RelFileNumber' type-id='63cf087c' id='58e4ef28'/>
    <typedef-decl name='TupleTableSlotOps' type-id='0f69d789' id='4ad8af4a'/>
    <typedef-decl name='intptr_t' type-id='bd54fe1a' id='33dbba72'/>
    <typedef-decl name='regproc' type-id='63cf087c' id='de491152'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' id='7f139c63'>
      <data-member access='private'>
        <var-decl name='fetch' type-id='4b17193f' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='var' type-id='8ecd93e4' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='wholerow' type-id='dfea21c8' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='assign_var' type-id='89567c3d' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='assign_tmp' type-id='0c2386a4' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='constval' type-id='154f1990' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='func' type-id='01ace714' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='boolexpr' type-id='8dec3f33' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='qualexpr' type-id='221c69c5' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='jump' type-id='221c69c5' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nulltest_row' type-id='8dde685d' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='param' type-id='db8d3af1' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='cparam' type-id='052f406c' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='casetest' type-id='6d4cc9f0' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='make_readonly' type-id='6d4cc9f0' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='iocoerce' type-id='3b773333' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sqlvaluefunction' type-id='1eb9c3ae' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='nextvalueexpr' type-id='12f5f526' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='arrayexpr' type-id='471f877a' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='arraycoerce' type-id='c17e1800' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='row' type-id='a19f65b2' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='rowcompare_step' type-id='ae4ad948' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='rowcompare_final' type-id='57460238' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='minmax' type-id='e523744d' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fieldselect' type-id='4be09a1c' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='fieldstore' type-id='1d070bd0' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sbsref_subscript' type-id='fa683c65' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='sbsref' type-id='95d46cc9' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='domaincheck' type-id='cd5af2ef' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='convert_rowtype' type-id='39ce71be' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='scalararrayop' type-id='f315c01c' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='hashedscalararrayop' type-id='3304a23a' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='xmlexpr' type-id='ca842759' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='json_constructor' type-id='72e92d3a' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aggref' type-id='38b50155' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='grouping_func' type-id='3b84f0d6' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='window_func' type-id='779e7fb0' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='subplan' type-id='34fa8b2c' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='agg_deserialize' type-id='0d73263b' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='agg_strict_input_check' type-id='ee5c1480' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='agg_plain_pergroup_nullcheck' type-id='8d9740b9' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='agg_presorted_distinctcheck' type-id='64955077' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='agg_trans' type-id='4840c6de' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='is_json' type-id='e4a33f20' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <pointer-type-def type-id='eea2deb8' size-in-bits='64' id='c6b151e7'/>
    <pointer-type-def type-id='dc4eb83f' size-in-bits='64' id='042f5542'/>
    <pointer-type-def type-id='6bdc0c3e' size-in-bits='64' id='f205808f'/>
    <array-type-def dimensions='1' type-id='3db40640' size-in-bits='128' id='0403c23f'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='546c8069' size-in-bits='64' id='3a14ea32'/>
    <pointer-type-def type-id='a76c026f' size-in-bits='64' id='ff83265a'/>
    <array-type-def dimensions='1' type-id='ddba9bc9' size-in-bits='infinite' id='3f6b39ca'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='16f01b5d' size-in-bits='64' id='8b7497cd'/>
    <pointer-type-def type-id='3de55dac' size-in-bits='64' id='4fc4ab07'/>
    <pointer-type-def type-id='4a2f935d' size-in-bits='64' id='b2f50009'/>
    <array-type-def dimensions='1' type-id='25f39bce' size-in-bits='infinite' id='b1f0fafd'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='4f9e23e8' size-in-bits='64' id='ac606329'/>
    <array-type-def dimensions='1' type-id='4f9e23e8' size-in-bits='infinite' id='93433141'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='63cf087c' size-in-bits='3200' id='6b765c6a'>
      <subrange length='100' type-id='7359adad' id='4196563c'/>
    </array-type-def>
    <pointer-type-def type-id='0ad5e557' size-in-bits='64' id='15a18f82'/>
    <array-type-def dimensions='1' type-id='16406887' size-in-bits='infinite' id='4f1256a8'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='20db3fac' size-in-bits='64' id='f18806f9'/>
    <pointer-type-def type-id='2a1b44b2' size-in-bits='64' id='8768804d'/>
    <pointer-type-def type-id='08e55fdf' size-in-bits='64' id='0e6ce0d6'/>
    <pointer-type-def type-id='858759f7' size-in-bits='64' id='563110bf'/>
    <pointer-type-def type-id='7e260591' size-in-bits='64' id='50db0561'/>
    <pointer-type-def type-id='47c63816' size-in-bits='64' id='390a8674'/>
    <pointer-type-def type-id='2b16adc8' size-in-bits='64' id='2f13296e'/>
    <pointer-type-def type-id='2d7d3949' size-in-bits='64' id='b1ef65cc'/>
    <pointer-type-def type-id='50aebc99' size-in-bits='64' id='f0d64c54'/>
    <pointer-type-def type-id='194c78d3' size-in-bits='64' id='aa8b2ff3'/>
    <array-type-def dimensions='1' type-id='d1885e4d' size-in-bits='256' id='2d63c7ed'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='337bdc9b' size-in-bits='infinite' id='0e160242'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='cfb3e584' size-in-bits='64' id='5760624e'/>
    <pointer-type-def type-id='cfc385bf' size-in-bits='64' id='2cb8ed83'/>
    <pointer-type-def type-id='6ef34894' size-in-bits='64' id='5b219226'/>
    <pointer-type-def type-id='07b64d75' size-in-bits='64' id='8e09e859'/>
    <pointer-type-def type-id='502ed071' size-in-bits='64' id='4d721265'/>
    <pointer-type-def type-id='91fdba25' size-in-bits='64' id='07848f31'/>
    <pointer-type-def type-id='2661e72d' size-in-bits='64' id='4a75c639'/>
    <pointer-type-def type-id='64879be1' size-in-bits='64' id='0f772ba5'/>
    <pointer-type-def type-id='892b2802' size-in-bits='64' id='25d4612c'/>
    <pointer-type-def type-id='3d329d3e' size-in-bits='64' id='7a5010f0'/>
    <pointer-type-def type-id='d84a5746' size-in-bits='64' id='ec4735d0'/>
    <pointer-type-def type-id='bce04fab' size-in-bits='64' id='bee3d46f'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='27643d14' size-in-bits='64' id='5a87d566'/>
    <qualified-type-def type-id='a722f4b0' const='yes' id='4c122643'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <pointer-type-def type-id='77af88f8' size-in-bits='64' id='8f3c25ba'/>
    <enum-decl name='PLpgSQL_nsitem_type' id='7a61f31d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_NSTYPE_LABEL' value='0'/>
      <enumerator name='PLPGSQL_NSTYPE_VAR' value='1'/>
      <enumerator name='PLPGSQL_NSTYPE_REC' value='2'/>
    </enum-decl>
    <enum-decl name='ParamKind' id='410f5d6f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PARAM_EXTERN' value='0'/>
      <enumerator name='PARAM_EXEC' value='1'/>
      <enumerator name='PARAM_SUBLINK' value='2'/>
      <enumerator name='PARAM_MULTIEXPR' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='128' id='2020bac4'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <class-decl name='BlockIdData' size-in-bits='32' is-struct='yes' visibility='default' id='2869d54f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bi_hi' type-id='06a3df2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bi_lo' type-id='06a3df2b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='FormData_pg_class' size-in-bits='1120' is-struct='yes' visibility='default' id='2bc808b6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='oid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='relname' type-id='d4b9f8ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='relnamespace' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reltype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='reloftype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='relowner' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='relam' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='relfilenode' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='reltablespace' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='relpages' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reltuples' type-id='b6d86a0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='relallvisible' type-id='93e3c360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='reltoastrelid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='relhasindex' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='relisshared' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='relpersistence' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='relkind' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='relnatts' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='944'>
        <var-decl name='relchecks' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='relhasrules' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='968'>
        <var-decl name='relhastriggers' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='976'>
        <var-decl name='relhassubclass' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='984'>
        <var-decl name='relrowsecurity' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='relforcerowsecurity' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1000'>
        <var-decl name='relispopulated' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1008'>
        <var-decl name='relreplident' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1016'>
        <var-decl name='relispartition' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='relrewrite' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='relfrozenxid' type-id='2d7d3949' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='relminmxid' type-id='2d7d3949' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='FormData_pg_index' size-in-bits='384' is-struct='yes' visibility='default' id='9c8bb25a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='indexrelid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='indrelid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='indnatts' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='indnkeyatts' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='indisunique' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='indnullsnotdistinct' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='indisprimary' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='indisexclusion' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='indimmediate' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='indisclustered' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='indisvalid' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='indcheckxmin' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='indisready' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='indislive' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='indisreplident' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='indkey' type-id='41ad24e2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='LockRelId' size-in-bits='64' is-struct='yes' visibility='default' id='0738d104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='relId' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dbId' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PLpgSQL_datum' size-in-bits='64' is-struct='yes' visibility='default' id='4ecb5a4c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dtype' type-id='8fdeefdc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dno' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TupleTableSlotOps' size-in-bits='768' is-struct='yes' visibility='default' id='0f69d789'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base_slot_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='9a56498a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='release' type-id='9a56498a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='clear' type-id='9a56498a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='getsomeattrs' type-id='ad9add71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='getsysattr' type-id='289e6cbb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='materialize' type-id='9a56498a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='copyslot' type-id='f5465184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_heap_tuple' type-id='c80a7bab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_minimal_tuple' type-id='e927a3d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='copy_heap_tuple' type-id='c80a7bab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='copy_minimal_tuple' type-id='e927a3d2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='64955077'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pertrans' type-id='22d3bcc1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aggcontext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='jumpdistinct' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='4840c6de'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pertrans' type-id='22d3bcc1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='aggcontext' type-id='47bae389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='setoff' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='4be09a1c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fieldnum' type-id='6bdc0c3e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='resulttype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rowcache' type-id='6d23b4a3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='154f1990'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='f24b0a4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isnull' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='471f877a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elemvalues' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='elemnulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nelems' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='elemtype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='elemlength' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='elembyval' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='elemalign' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='multidims' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='6d4cc9f0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='e523744d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='values' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nelems' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='op' type-id='f012c4d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='finfo' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='fa683c65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subscriptfunc' type-id='957dd9fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='state' type-id='b337bec6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='jumpdone' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='052f406c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='paramfunc' type-id='5b661f31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paramarg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='paramid' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='paramtype' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='95d46cc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subscriptfunc' type-id='5b661f31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='state' type-id='b337bec6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='8dde685d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rowcache' type-id='6d23b4a3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='c17e1800'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elemexprstate' type-id='6460b71b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resultelemtype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='amstate' type-id='7776142d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='1d070bd0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fstore' type-id='668f87de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rowcache' type-id='09327ce4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='values' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ncolumns' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='ae4ad948'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finfo' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fn_addr' type-id='bf77460d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='jumpnull' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='jumpdone' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='01ace714'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finfo' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fn_addr' type-id='bf77460d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nargs' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='3b773333'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finfo_out' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fcinfo_data_out' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='finfo_in' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fcinfo_data_in' type-id='cbf1f029' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='0d73263b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='jumpnull' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='72e92d3a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='jcstate' type-id='33c89107' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e4a33f20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pred' type-id='d5f30022' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='3b84f0d6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='clauses' type-id='c2e26fd1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='ee5c1480'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='args' type-id='2f0d000f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nargs' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='jumpnull' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='f315c01c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='element_type' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='useOr' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='typlen' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='typbyval' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='typalign' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='finfo' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fn_addr' type-id='bf77460d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='39ce71be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inputtype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='outputtype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='incache' type-id='09327ce4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='outcache' type-id='09327ce4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='map' type-id='163db565' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='12f5f526'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seqid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='seqtypid' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='57460238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rctype' type-id='0d6fd59f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='1eb9c3ae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='svf' type-id='57758142' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='34fa8b2c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sstate' type-id='6d8ec8b7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='a19f65b2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tupdesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='elemvalues' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='elemnulls' type-id='d8e6b335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='dfea21c8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='var' type-id='10530c9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='first' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='slow' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tupdesc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='junkFilter' type-id='763b1c4d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='779e7fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wfstate' type-id='3dc2b291' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='ca842759'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='xexpr' type-id='92862e91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='named_argvalue' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='named_argnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='argvalue' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='argnull' type-id='d8e6b335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' id='3304a23a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='has_nulls' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='inclause' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='elements_tab' type-id='870f75f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='finfo' type-id='335fd962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fcinfo_data' type-id='cbf1f029' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='saop' type-id='b48149d0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='8dec3f33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anynull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='jumpdone' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' id='cd5af2ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='constraintname' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='checkvalue' type-id='87794d52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='checknull' type-id='d8e6b335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='resulttype' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='38b50155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aggno' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='8ecd93e4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attnum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vartype' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='221c69c5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='jumpdone' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='4b17193f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_var' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fixed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='known_desc' type-id='39243d9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kind' type-id='a722f4b0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='db8d3af1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='paramid' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='paramtype' type-id='63cf087c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='89567c3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resultnum' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='attnum' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='0c2386a4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resultnum' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='8d9740b9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='setoff' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='jumpnull' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='BlockNumber' type-id='7aa912f5' id='3db40640'/>
    <typedef-decl name='BufferUsage' type-id='540c4462' id='bec09531'/>
    <typedef-decl name='CTEMaterialize' type-id='7743f283' id='c0bf5007'/>
    <typedef-decl name='CmdType' type-id='a2526320' id='af8a0214'/>
    <typedef-decl name='CommandTag' type-id='dbec090f' id='a18bc913'/>
    <typedef-decl name='HeapTupleHeaderData' type-id='aa8d7906' id='03f6d8e9'/>
    <pointer-type-def type-id='2096ae18' size-in-bits='64' id='dca928c2'/>
    <typedef-decl name='PLpgSQL_stmt_type' type-id='ed55f0ff' id='75f63103'/>
    <typedef-decl name='PLpgSQL_type_type' type-id='f4a6ce49' id='736dc355'/>
    <typedef-decl name='ParamCompileHook' type-id='df00b2e4' id='b831bad1'/>
    <typedef-decl name='ParamFetchHook' type-id='3c1a52d5' id='a3de2d94'/>
    <typedef-decl name='ParserSetupHook' type-id='cff19eca' id='df87ed5b'/>
    <typedef-decl name='PublicationActions' type-id='a62895b4' id='ae282a3d'/>
    <typedef-decl name='RelFileLocatorBackend' type-id='34173ff8' id='24ad344f'/>
    <typedef-decl name='Relation' type-id='27104062' id='c79d68a9'/>
    <pointer-type-def type-id='91e8065f' size-in-bits='64' id='11c65a0b'/>
    <pointer-type-def type-id='fdc3960d' size-in-bits='64' id='d773ab59'/>
    <typedef-decl name='SnapshotType' type-id='7ecac09c' id='92c892a0'/>
    <pointer-type-def type-id='07cee8d4' size-in-bits='64' id='0cf7ee5e'/>
    <pointer-type-def type-id='aa2df4d1' size-in-bits='64' id='70dac445'/>
    <pointer-type-def type-id='a5b5e4e7' size-in-bits='64' id='c734c22b'/>
    <pointer-type-def type-id='baed5ec6' size-in-bits='64' id='12479770'/>
    <typedef-decl name='TimestampTz' type-id='27dc5d97' id='7448fdb6'/>
    <pointer-type-def type-id='a212ab3d' size-in-bits='64' id='d2aca269'/>
    <typedef-decl name='WalUsage' type-id='384a99c2' id='cb65ae2b'/>
    <typedef-decl name='XLogRecPtr' type-id='f69d0a36' id='cdb01e8a'/>
    <typedef-decl name='dlist_node' type-id='e82100c0' id='7ec7d215'/>
    <typedef-decl name='instr_time' type-id='a25de323' id='bec842ce'/>
    <typedef-decl name='int64' type-id='bd54fe1a' id='27dc5d97'/>
    <typedef-decl name='pairingheap_node' type-id='7072f006' id='e72a9a83'/>
    <typedef-decl name='slist_node' type-id='7aa1cb7b' id='f13aab3e'/>
    <pointer-type-def type-id='12b5cdae' size-in-bits='64' id='0feda258'/>
    <pointer-type-def type-id='d06a4608' size-in-bits='64' id='85893be2'/>
    <pointer-type-def type-id='5edfc9dc' size-in-bits='64' id='49a7cf56'/>
    <pointer-type-def type-id='c090d1d5' size-in-bits='64' id='f2b1da41'/>
    <pointer-type-def type-id='45f1172c' size-in-bits='64' id='c1be146e'/>
    <pointer-type-def type-id='44c39c1d' size-in-bits='64' id='5a898ed9'/>
    <pointer-type-def type-id='167f30d5' size-in-bits='64' id='ef6a1459'/>
    <pointer-type-def type-id='290bdbc9' size-in-bits='64' id='97ed04e5'/>
    <pointer-type-def type-id='77c641b2' size-in-bits='64' id='2b3b1f1c'/>
    <pointer-type-def type-id='910c447f' size-in-bits='64' id='e01d8093'/>
    <pointer-type-def type-id='f5fdfd36' size-in-bits='64' id='ca493d20'/>
    <pointer-type-def type-id='2a093c36' size-in-bits='64' id='1ff7fe08'/>
    <pointer-type-def type-id='52c43603' size-in-bits='64' id='74ff6c8f'/>
    <pointer-type-def type-id='0ea78b5c' size-in-bits='64' id='5eda35ee'/>
    <pointer-type-def type-id='2ad725bf' size-in-bits='64' id='4c8fbedb'/>
    <pointer-type-def type-id='a1036fba' size-in-bits='64' id='2931a6a4'/>
    <pointer-type-def type-id='5ed911e5' size-in-bits='64' id='d6174351'/>
    <pointer-type-def type-id='94c2a909' size-in-bits='64' id='5c77fa5d'/>
    <pointer-type-def type-id='b345e47b' size-in-bits='64' id='158a83bf'/>
    <pointer-type-def type-id='7f60fd78' size-in-bits='64' id='3eaabdfa'/>
    <pointer-type-def type-id='284ffa43' size-in-bits='64' id='6da8c08f'/>
    <pointer-type-def type-id='88ed490d' size-in-bits='64' id='7776142d'/>
    <pointer-type-def type-id='6d23b4a3' size-in-bits='64' id='09327ce4'/>
    <pointer-type-def type-id='de8f9c31' size-in-bits='64' id='668f87de'/>
    <pointer-type-def type-id='a736f7b4' size-in-bits='64' id='335fd962'/>
    <pointer-type-def type-id='d253d76f' size-in-bits='64' id='33c89107'/>
    <pointer-type-def type-id='a378692f' size-in-bits='64' id='d5f30022'/>
    <pointer-type-def type-id='73f7fd18' size-in-bits='64' id='2f0d000f'/>
    <pointer-type-def type-id='37c441c1' size-in-bits='64' id='3c1a52d5'/>
    <pointer-type-def type-id='a73b6b5a' size-in-bits='64' id='27104062'/>
    <pointer-type-def type-id='9fc747fa' size-in-bits='64' id='7e260591'/>
    <pointer-type-def type-id='9587e87d' size-in-bits='64' id='57758142'/>
    <pointer-type-def type-id='f4c742b5' size-in-bits='64' id='b48149d0'/>
    <pointer-type-def type-id='d12202ba' size-in-bits='64' id='870f75f8'/>
    <pointer-type-def type-id='c8a482d6' size-in-bits='64' id='6d8ec8b7'/>
    <pointer-type-def type-id='6f8bb1e0' size-in-bits='64' id='b337bec6'/>
    <pointer-type-def type-id='3365c9bd' size-in-bits='64' id='10530c9c'/>
    <pointer-type-def type-id='41441fe2' size-in-bits='64' id='3dc2b291'/>
    <pointer-type-def type-id='073facf6' size-in-bits='64' id='92862e91'/>
    <pointer-type-def type-id='20ae5afd' size-in-bits='64' id='d1885e4d'/>
    <enum-decl name='CTEMaterialize' id='7743f283'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='CTEMaterializeDefault' value='0'/>
      <enumerator name='CTEMaterializeAlways' value='1'/>
      <enumerator name='CTEMaterializeNever' value='2'/>
    </enum-decl>
    <enum-decl name='CmdType' id='a2526320'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='CMD_UNKNOWN' value='0'/>
      <enumerator name='CMD_SELECT' value='1'/>
      <enumerator name='CMD_UPDATE' value='2'/>
      <enumerator name='CMD_INSERT' value='3'/>
      <enumerator name='CMD_DELETE' value='4'/>
      <enumerator name='CMD_MERGE' value='5'/>
      <enumerator name='CMD_UTILITY' value='6'/>
      <enumerator name='CMD_NOTHING' value='7'/>
    </enum-decl>
    <enum-decl name='CommandTag' id='dbec090f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='CMDTAG_UNKNOWN' value='0'/>
      <enumerator name='CMDTAG_ALTER_ACCESS_METHOD' value='1'/>
      <enumerator name='CMDTAG_ALTER_AGGREGATE' value='2'/>
      <enumerator name='CMDTAG_ALTER_CAST' value='3'/>
      <enumerator name='CMDTAG_ALTER_COLLATION' value='4'/>
      <enumerator name='CMDTAG_ALTER_CONSTRAINT' value='5'/>
      <enumerator name='CMDTAG_ALTER_CONVERSION' value='6'/>
      <enumerator name='CMDTAG_ALTER_DATABASE' value='7'/>
      <enumerator name='CMDTAG_ALTER_DEFAULT_PRIVILEGES' value='8'/>
      <enumerator name='CMDTAG_ALTER_DOMAIN' value='9'/>
      <enumerator name='CMDTAG_ALTER_EVENT_TRIGGER' value='10'/>
      <enumerator name='CMDTAG_ALTER_EXTENSION' value='11'/>
      <enumerator name='CMDTAG_ALTER_FOREIGN_DATA_WRAPPER' value='12'/>
      <enumerator name='CMDTAG_ALTER_FOREIGN_TABLE' value='13'/>
      <enumerator name='CMDTAG_ALTER_FUNCTION' value='14'/>
      <enumerator name='CMDTAG_ALTER_INDEX' value='15'/>
      <enumerator name='CMDTAG_ALTER_LANGUAGE' value='16'/>
      <enumerator name='CMDTAG_ALTER_LARGE_OBJECT' value='17'/>
      <enumerator name='CMDTAG_ALTER_MATERIALIZED_VIEW' value='18'/>
      <enumerator name='CMDTAG_ALTER_OPERATOR' value='19'/>
      <enumerator name='CMDTAG_ALTER_OPERATOR_CLASS' value='20'/>
      <enumerator name='CMDTAG_ALTER_OPERATOR_FAMILY' value='21'/>
      <enumerator name='CMDTAG_ALTER_POLICY' value='22'/>
      <enumerator name='CMDTAG_ALTER_PROCEDURE' value='23'/>
      <enumerator name='CMDTAG_ALTER_PUBLICATION' value='24'/>
      <enumerator name='CMDTAG_ALTER_ROLE' value='25'/>
      <enumerator name='CMDTAG_ALTER_ROUTINE' value='26'/>
      <enumerator name='CMDTAG_ALTER_RULE' value='27'/>
      <enumerator name='CMDTAG_ALTER_SCHEMA' value='28'/>
      <enumerator name='CMDTAG_ALTER_SEQUENCE' value='29'/>
      <enumerator name='CMDTAG_ALTER_SERVER' value='30'/>
      <enumerator name='CMDTAG_ALTER_STATISTICS' value='31'/>
      <enumerator name='CMDTAG_ALTER_SUBSCRIPTION' value='32'/>
      <enumerator name='CMDTAG_ALTER_SYSTEM' value='33'/>
      <enumerator name='CMDTAG_ALTER_TABLE' value='34'/>
      <enumerator name='CMDTAG_ALTER_TABLESPACE' value='35'/>
      <enumerator name='CMDTAG_ALTER_TEXT_SEARCH_CONFIGURATION' value='36'/>
      <enumerator name='CMDTAG_ALTER_TEXT_SEARCH_DICTIONARY' value='37'/>
      <enumerator name='CMDTAG_ALTER_TEXT_SEARCH_PARSER' value='38'/>
      <enumerator name='CMDTAG_ALTER_TEXT_SEARCH_TEMPLATE' value='39'/>
      <enumerator name='CMDTAG_ALTER_TRANSFORM' value='40'/>
      <enumerator name='CMDTAG_ALTER_TRIGGER' value='41'/>
      <enumerator name='CMDTAG_ALTER_TYPE' value='42'/>
      <enumerator name='CMDTAG_ALTER_USER_MAPPING' value='43'/>
      <enumerator name='CMDTAG_ALTER_VIEW' value='44'/>
      <enumerator name='CMDTAG_ANALYZE' value='45'/>
      <enumerator name='CMDTAG_BEGIN' value='46'/>
      <enumerator name='CMDTAG_CALL' value='47'/>
      <enumerator name='CMDTAG_CHECKPOINT' value='48'/>
      <enumerator name='CMDTAG_CLOSE' value='49'/>
      <enumerator name='CMDTAG_CLOSE_CURSOR' value='50'/>
      <enumerator name='CMDTAG_CLOSE_CURSOR_ALL' value='51'/>
      <enumerator name='CMDTAG_CLUSTER' value='52'/>
      <enumerator name='CMDTAG_COMMENT' value='53'/>
      <enumerator name='CMDTAG_COMMIT' value='54'/>
      <enumerator name='CMDTAG_COMMIT_PREPARED' value='55'/>
      <enumerator name='CMDTAG_COPY' value='56'/>
      <enumerator name='CMDTAG_COPY_FROM' value='57'/>
      <enumerator name='CMDTAG_CREATE_ACCESS_METHOD' value='58'/>
      <enumerator name='CMDTAG_CREATE_AGGREGATE' value='59'/>
      <enumerator name='CMDTAG_CREATE_CAST' value='60'/>
      <enumerator name='CMDTAG_CREATE_COLLATION' value='61'/>
      <enumerator name='CMDTAG_CREATE_CONSTRAINT' value='62'/>
      <enumerator name='CMDTAG_CREATE_CONVERSION' value='63'/>
      <enumerator name='CMDTAG_CREATE_DATABASE' value='64'/>
      <enumerator name='CMDTAG_CREATE_DOMAIN' value='65'/>
      <enumerator name='CMDTAG_CREATE_EVENT_TRIGGER' value='66'/>
      <enumerator name='CMDTAG_CREATE_EXTENSION' value='67'/>
      <enumerator name='CMDTAG_CREATE_FOREIGN_DATA_WRAPPER' value='68'/>
      <enumerator name='CMDTAG_CREATE_FOREIGN_TABLE' value='69'/>
      <enumerator name='CMDTAG_CREATE_FUNCTION' value='70'/>
      <enumerator name='CMDTAG_CREATE_INDEX' value='71'/>
      <enumerator name='CMDTAG_CREATE_LANGUAGE' value='72'/>
      <enumerator name='CMDTAG_CREATE_MATERIALIZED_VIEW' value='73'/>
      <enumerator name='CMDTAG_CREATE_OPERATOR' value='74'/>
      <enumerator name='CMDTAG_CREATE_OPERATOR_CLASS' value='75'/>
      <enumerator name='CMDTAG_CREATE_OPERATOR_FAMILY' value='76'/>
      <enumerator name='CMDTAG_CREATE_POLICY' value='77'/>
      <enumerator name='CMDTAG_CREATE_PROCEDURE' value='78'/>
      <enumerator name='CMDTAG_CREATE_PUBLICATION' value='79'/>
      <enumerator name='CMDTAG_CREATE_ROLE' value='80'/>
      <enumerator name='CMDTAG_CREATE_ROUTINE' value='81'/>
      <enumerator name='CMDTAG_CREATE_RULE' value='82'/>
      <enumerator name='CMDTAG_CREATE_SCHEMA' value='83'/>
      <enumerator name='CMDTAG_CREATE_SEQUENCE' value='84'/>
      <enumerator name='CMDTAG_CREATE_SERVER' value='85'/>
      <enumerator name='CMDTAG_CREATE_STATISTICS' value='86'/>
      <enumerator name='CMDTAG_CREATE_SUBSCRIPTION' value='87'/>
      <enumerator name='CMDTAG_CREATE_TABLE' value='88'/>
      <enumerator name='CMDTAG_CREATE_TABLE_AS' value='89'/>
      <enumerator name='CMDTAG_CREATE_TABLESPACE' value='90'/>
      <enumerator name='CMDTAG_CREATE_TEXT_SEARCH_CONFIGURATION' value='91'/>
      <enumerator name='CMDTAG_CREATE_TEXT_SEARCH_DICTIONARY' value='92'/>
      <enumerator name='CMDTAG_CREATE_TEXT_SEARCH_PARSER' value='93'/>
      <enumerator name='CMDTAG_CREATE_TEXT_SEARCH_TEMPLATE' value='94'/>
      <enumerator name='CMDTAG_CREATE_TRANSFORM' value='95'/>
      <enumerator name='CMDTAG_CREATE_TRIGGER' value='96'/>
      <enumerator name='CMDTAG_CREATE_TYPE' value='97'/>
      <enumerator name='CMDTAG_CREATE_USER_MAPPING' value='98'/>
      <enumerator name='CMDTAG_CREATE_VIEW' value='99'/>
      <enumerator name='CMDTAG_DEALLOCATE' value='100'/>
      <enumerator name='CMDTAG_DEALLOCATE_ALL' value='101'/>
      <enumerator name='CMDTAG_DECLARE_CURSOR' value='102'/>
      <enumerator name='CMDTAG_DELETE' value='103'/>
      <enumerator name='CMDTAG_DISCARD' value='104'/>
      <enumerator name='CMDTAG_DISCARD_ALL' value='105'/>
      <enumerator name='CMDTAG_DISCARD_PLANS' value='106'/>
      <enumerator name='CMDTAG_DISCARD_SEQUENCES' value='107'/>
      <enumerator name='CMDTAG_DISCARD_TEMP' value='108'/>
      <enumerator name='CMDTAG_DO' value='109'/>
      <enumerator name='CMDTAG_DROP_ACCESS_METHOD' value='110'/>
      <enumerator name='CMDTAG_DROP_AGGREGATE' value='111'/>
      <enumerator name='CMDTAG_DROP_CAST' value='112'/>
      <enumerator name='CMDTAG_DROP_COLLATION' value='113'/>
      <enumerator name='CMDTAG_DROP_CONSTRAINT' value='114'/>
      <enumerator name='CMDTAG_DROP_CONVERSION' value='115'/>
      <enumerator name='CMDTAG_DROP_DATABASE' value='116'/>
      <enumerator name='CMDTAG_DROP_DOMAIN' value='117'/>
      <enumerator name='CMDTAG_DROP_EVENT_TRIGGER' value='118'/>
      <enumerator name='CMDTAG_DROP_EXTENSION' value='119'/>
      <enumerator name='CMDTAG_DROP_FOREIGN_DATA_WRAPPER' value='120'/>
      <enumerator name='CMDTAG_DROP_FOREIGN_TABLE' value='121'/>
      <enumerator name='CMDTAG_DROP_FUNCTION' value='122'/>
      <enumerator name='CMDTAG_DROP_INDEX' value='123'/>
      <enumerator name='CMDTAG_DROP_LANGUAGE' value='124'/>
      <enumerator name='CMDTAG_DROP_MATERIALIZED_VIEW' value='125'/>
      <enumerator name='CMDTAG_DROP_OPERATOR' value='126'/>
      <enumerator name='CMDTAG_DROP_OPERATOR_CLASS' value='127'/>
      <enumerator name='CMDTAG_DROP_OPERATOR_FAMILY' value='128'/>
      <enumerator name='CMDTAG_DROP_OWNED' value='129'/>
      <enumerator name='CMDTAG_DROP_POLICY' value='130'/>
      <enumerator name='CMDTAG_DROP_PROCEDURE' value='131'/>
      <enumerator name='CMDTAG_DROP_PUBLICATION' value='132'/>
      <enumerator name='CMDTAG_DROP_ROLE' value='133'/>
      <enumerator name='CMDTAG_DROP_ROUTINE' value='134'/>
      <enumerator name='CMDTAG_DROP_RULE' value='135'/>
      <enumerator name='CMDTAG_DROP_SCHEMA' value='136'/>
      <enumerator name='CMDTAG_DROP_SEQUENCE' value='137'/>
      <enumerator name='CMDTAG_DROP_SERVER' value='138'/>
      <enumerator name='CMDTAG_DROP_STATISTICS' value='139'/>
      <enumerator name='CMDTAG_DROP_SUBSCRIPTION' value='140'/>
      <enumerator name='CMDTAG_DROP_TABLE' value='141'/>
      <enumerator name='CMDTAG_DROP_TABLESPACE' value='142'/>
      <enumerator name='CMDTAG_DROP_TEXT_SEARCH_CONFIGURATION' value='143'/>
      <enumerator name='CMDTAG_DROP_TEXT_SEARCH_DICTIONARY' value='144'/>
      <enumerator name='CMDTAG_DROP_TEXT_SEARCH_PARSER' value='145'/>
      <enumerator name='CMDTAG_DROP_TEXT_SEARCH_TEMPLATE' value='146'/>
      <enumerator name='CMDTAG_DROP_TRANSFORM' value='147'/>
      <enumerator name='CMDTAG_DROP_TRIGGER' value='148'/>
      <enumerator name='CMDTAG_DROP_TYPE' value='149'/>
      <enumerator name='CMDTAG_DROP_USER_MAPPING' value='150'/>
      <enumerator name='CMDTAG_DROP_VIEW' value='151'/>
      <enumerator name='CMDTAG_EXECUTE' value='152'/>
      <enumerator name='CMDTAG_EXPLAIN' value='153'/>
      <enumerator name='CMDTAG_FETCH' value='154'/>
      <enumerator name='CMDTAG_GRANT' value='155'/>
      <enumerator name='CMDTAG_GRANT_ROLE' value='156'/>
      <enumerator name='CMDTAG_IMPORT_FOREIGN_SCHEMA' value='157'/>
      <enumerator name='CMDTAG_INSERT' value='158'/>
      <enumerator name='CMDTAG_LISTEN' value='159'/>
      <enumerator name='CMDTAG_LOAD' value='160'/>
      <enumerator name='CMDTAG_LOCK_TABLE' value='161'/>
      <enumerator name='CMDTAG_LOGIN' value='162'/>
      <enumerator name='CMDTAG_MERGE' value='163'/>
      <enumerator name='CMDTAG_MOVE' value='164'/>
      <enumerator name='CMDTAG_NOTIFY' value='165'/>
      <enumerator name='CMDTAG_PREPARE' value='166'/>
      <enumerator name='CMDTAG_PREPARE_TRANSACTION' value='167'/>
      <enumerator name='CMDTAG_REASSIGN_OWNED' value='168'/>
      <enumerator name='CMDTAG_REFRESH_MATERIALIZED_VIEW' value='169'/>
      <enumerator name='CMDTAG_REINDEX' value='170'/>
      <enumerator name='CMDTAG_RELEASE' value='171'/>
      <enumerator name='CMDTAG_RESET' value='172'/>
      <enumerator name='CMDTAG_REVOKE' value='173'/>
      <enumerator name='CMDTAG_REVOKE_ROLE' value='174'/>
      <enumerator name='CMDTAG_ROLLBACK' value='175'/>
      <enumerator name='CMDTAG_ROLLBACK_PREPARED' value='176'/>
      <enumerator name='CMDTAG_SAVEPOINT' value='177'/>
      <enumerator name='CMDTAG_SECURITY_LABEL' value='178'/>
      <enumerator name='CMDTAG_SELECT' value='179'/>
      <enumerator name='CMDTAG_SELECT_FOR_KEY_SHARE' value='180'/>
      <enumerator name='CMDTAG_SELECT_FOR_NO_KEY_UPDATE' value='181'/>
      <enumerator name='CMDTAG_SELECT_FOR_SHARE' value='182'/>
      <enumerator name='CMDTAG_SELECT_FOR_UPDATE' value='183'/>
      <enumerator name='CMDTAG_SELECT_INTO' value='184'/>
      <enumerator name='CMDTAG_SET' value='185'/>
      <enumerator name='CMDTAG_SET_CONSTRAINTS' value='186'/>
      <enumerator name='CMDTAG_SHOW' value='187'/>
      <enumerator name='CMDTAG_START_TRANSACTION' value='188'/>
      <enumerator name='CMDTAG_TRUNCATE_TABLE' value='189'/>
      <enumerator name='CMDTAG_UNLISTEN' value='190'/>
      <enumerator name='CMDTAG_UPDATE' value='191'/>
      <enumerator name='CMDTAG_VACUUM' value='192'/>
      <enumerator name='COMMAND_TAG_NEXTTAG' value='193'/>
    </enum-decl>
    <enum-decl name='PLpgSQL_stmt_type' id='ed55f0ff'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_STMT_BLOCK' value='0'/>
      <enumerator name='PLPGSQL_STMT_ASSIGN' value='1'/>
      <enumerator name='PLPGSQL_STMT_IF' value='2'/>
      <enumerator name='PLPGSQL_STMT_CASE' value='3'/>
      <enumerator name='PLPGSQL_STMT_LOOP' value='4'/>
      <enumerator name='PLPGSQL_STMT_WHILE' value='5'/>
      <enumerator name='PLPGSQL_STMT_FORI' value='6'/>
      <enumerator name='PLPGSQL_STMT_FORS' value='7'/>
      <enumerator name='PLPGSQL_STMT_FORC' value='8'/>
      <enumerator name='PLPGSQL_STMT_FOREACH_A' value='9'/>
      <enumerator name='PLPGSQL_STMT_EXIT' value='10'/>
      <enumerator name='PLPGSQL_STMT_RETURN' value='11'/>
      <enumerator name='PLPGSQL_STMT_RETURN_NEXT' value='12'/>
      <enumerator name='PLPGSQL_STMT_RETURN_QUERY' value='13'/>
      <enumerator name='PLPGSQL_STMT_RAISE' value='14'/>
      <enumerator name='PLPGSQL_STMT_ASSERT' value='15'/>
      <enumerator name='PLPGSQL_STMT_EXECSQL' value='16'/>
      <enumerator name='PLPGSQL_STMT_DYNEXECUTE' value='17'/>
      <enumerator name='PLPGSQL_STMT_DYNFORS' value='18'/>
      <enumerator name='PLPGSQL_STMT_GETDIAG' value='19'/>
      <enumerator name='PLPGSQL_STMT_OPEN' value='20'/>
      <enumerator name='PLPGSQL_STMT_FETCH' value='21'/>
      <enumerator name='PLPGSQL_STMT_CLOSE' value='22'/>
      <enumerator name='PLPGSQL_STMT_PERFORM' value='23'/>
      <enumerator name='PLPGSQL_STMT_CALL' value='24'/>
      <enumerator name='PLPGSQL_STMT_COMMIT' value='25'/>
      <enumerator name='PLPGSQL_STMT_ROLLBACK' value='26'/>
    </enum-decl>
    <enum-decl name='PLpgSQL_type_type' id='f4a6ce49'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='PLPGSQL_TTYPE_SCALAR' value='0'/>
      <enumerator name='PLPGSQL_TTYPE_REC' value='1'/>
      <enumerator name='PLPGSQL_TTYPE_PSEUDO' value='2'/>
    </enum-decl>
    <enum-decl name='SnapshotType' id='7ecac09c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SNAPSHOT_MVCC' value='0'/>
      <enumerator name='SNAPSHOT_SELF' value='1'/>
      <enumerator name='SNAPSHOT_ANY' value='2'/>
      <enumerator name='SNAPSHOT_TOAST' value='3'/>
      <enumerator name='SNAPSHOT_DIRTY' value='4'/>
      <enumerator name='SNAPSHOT_HISTORIC_MVCC' value='5'/>
      <enumerator name='SNAPSHOT_NON_VACUUMABLE' value='6'/>
    </enum-decl>
    <class-decl name='BufferUsage' size-in-bits='1024' is-struct='yes' visibility='default' id='540c4462'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shared_blks_hit' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='shared_blks_read' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='shared_blks_dirtied' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='shared_blks_written' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='local_blks_hit' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='local_blks_read' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='local_blks_dirtied' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='local_blks_written' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='temp_blks_read' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='temp_blks_written' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='shared_blk_read_time' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='shared_blk_write_time' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='local_blk_read_time' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='local_blk_write_time' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='temp_blk_read_time' type-id='bec842ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='temp_blk_write_time' type-id='bec842ce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='GlobalVisState' is-struct='yes' visibility='default' is-declaration-only='yes' id='16f01b5d'/>
    <class-decl name='HeapTupleHeaderData' size-in-bits='192' is-struct='yes' visibility='default' id='aa8d7906'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='t_choice' type-id='94e19b80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='t_ctid' type-id='f228c910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='t_infomask2' type-id='06a3df2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='t_infomask' type-id='06a3df2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='t_hoff' type-id='78b39644' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='t_bits' type-id='767ab51f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='PublicationActions' size-in-bits='32' is-struct='yes' visibility='default' id='a62895b4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubinsert' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pubupdate' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pubdelete' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='pubtruncate' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='RawStmt' size-in-bits='192' is-struct='yes' visibility='default' id='858759f7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='57011038' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stmt' type-id='86bcc405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stmt_location' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='stmt_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='RelFileLocatorBackend' size-in-bits='128' is-struct='yes' visibility='default' id='34173ff8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locator' type-id='b67cbde5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='backend' type-id='71ae5a39' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='SearchPathMatcher' size-in-bits='192' is-struct='yes' visibility='default' id='2b16adc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='schemas' type-id='c2e26fd1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addCatalog' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='addTemp' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='generation' type-id='f69d0a36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='TypeCacheEntry' size-in-bits='3904' is-struct='yes' visibility='default' id='194c78d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type_id' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type_id_hash' type-id='7aa912f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='typlen' type-id='27de9c2e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='typbyval' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='typalign' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='typstorage' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='typtype' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='typrelid' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='typsubscript' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='typelem' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='typcollation' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='btree_opf' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='btree_opintype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hash_opf' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='hash_opintype' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='eq_opr' type-id='63cf087c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lt_opr' type-id='63cf087c' visibility='default'/>
      </data-member>
