<abi-corpus path='src/interfaces/ecpg/pgtypeslib/libpgtypes.so.3.16' architecture='elf-amd-x86_64' soname='libpgtypes.so.3'>
  <elf-function-symbols>
    <elf-symbol name='PGTYPESchar_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_dayofweek' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_defmt_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_fmt_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_from_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_from_timestamp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_julmdy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_mdyjul' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_to_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdate_today' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdecimal_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESdecimal_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESinterval_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESinterval_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESinterval_from_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESinterval_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESinterval_to_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_cmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_div' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_from_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_from_decimal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_from_double' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_from_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_from_long' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_mul' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_sub' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_to_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_to_decimal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_to_double' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_to_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPESnumeric_to_long' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_add_interval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_current' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_defmt_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_defmt_scan' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_fmt_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_from_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_sub' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_sub_interval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PGTYPEStimestamp_to_asc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/common.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <function-decl name='PGTYPESchar_free' mangled-name='PGTYPESchar_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESchar_free'>
      <parameter type-id='26a90f95' name='ptr'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/datetime.c' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <typedef-decl name='date' type-id='bd54fe1a' id='ee6f28c8'/>
    <typedef-decl name='timestamp' type-id='27dc5d97' id='71758a2c'/>
    <typedef-decl name='int64' type-id='bd54fe1a' id='27dc5d97'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='ee6f28c8' size-in-bits='64' id='e3d10909'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <function-decl name='PGTYPESdate_defmt_asc' mangled-name='PGTYPESdate_defmt_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_defmt_asc'>
      <parameter type-id='e3d10909' name='d'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESdate_fmt_asc' mangled-name='PGTYPESdate_fmt_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_fmt_asc'>
      <parameter type-id='ee6f28c8' name='dDate'/>
      <parameter type-id='80f4b756' name='fmtstring'/>
      <parameter type-id='26a90f95' name='outbuf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESdate_today' mangled-name='PGTYPESdate_today' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_today'>
      <parameter type-id='e3d10909' name='d'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESdate_dayofweek' mangled-name='PGTYPESdate_dayofweek' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_dayofweek'>
      <parameter type-id='ee6f28c8' name='dDate'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESdate_mdyjul' mangled-name='PGTYPESdate_mdyjul' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_mdyjul'>
      <parameter type-id='7292109c' name='mdy'/>
      <parameter type-id='e3d10909' name='jdate'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESdate_julmdy' mangled-name='PGTYPESdate_julmdy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_julmdy'>
      <parameter type-id='ee6f28c8' name='jd'/>
      <parameter type-id='7292109c' name='mdy'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESdate_to_asc' mangled-name='PGTYPESdate_to_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_to_asc'>
      <parameter type-id='ee6f28c8' name='dDate'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='PGTYPESdate_from_asc' mangled-name='PGTYPESdate_from_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_from_asc'>
      <parameter type-id='26a90f95' name='str'/>
      <parameter type-id='9b23c9ad' name='endptr'/>
      <return type-id='ee6f28c8'/>
    </function-decl>
    <function-decl name='PGTYPESdate_from_timestamp' mangled-name='PGTYPESdate_from_timestamp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_from_timestamp'>
      <parameter type-id='71758a2c' name='dt'/>
      <return type-id='ee6f28c8'/>
    </function-decl>
    <function-decl name='PGTYPESdate_free' mangled-name='PGTYPESdate_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_free'>
      <parameter type-id='e3d10909' name='d'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESdate_new' mangled-name='PGTYPESdate_new' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdate_new'>
      <return type-id='e3d10909'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/dt_common.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='832' id='c8886dd1'>
      <subrange length='13' type-id='7359adad' id='487fded1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='512' id='460b55b1'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='26a90f95' size-in-bits='infinite' id='ed7b5735'>
      <subrange length='infinite' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='2' type-id='2448a865' size-in-bits='832' id='427248b3'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
      <subrange length='13' type-id='7359adad' id='487fded1'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <pointer-type-def type-id='71758a2c' size-in-bits='64' id='0e885d2b'/>
    <var-decl name='day_tab' type-id='427248b3' visibility='default'/>
    <var-decl name='months' type-id='ed7b5735' visibility='default'/>
    <var-decl name='days' type-id='ed7b5735' visibility='default'/>
    <var-decl name='pgtypes_date_weekdays_short' type-id='ed7b5735' visibility='default'/>
    <var-decl name='pgtypes_date_months' type-id='ed7b5735' visibility='default'/>
    <function-decl name='PGTYPEStimestamp_defmt_scan' mangled-name='PGTYPEStimestamp_defmt_scan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_defmt_scan'>
      <parameter type-id='9b23c9ad' name='str'/>
      <parameter type-id='26a90f95' name='fmt'/>
      <parameter type-id='0e885d2b' name='d'/>
      <parameter type-id='7292109c' name='year'/>
      <parameter type-id='7292109c' name='month'/>
      <parameter type-id='7292109c' name='day'/>
      <parameter type-id='7292109c' name='hour'/>
      <parameter type-id='7292109c' name='minute'/>
      <parameter type-id='7292109c' name='second'/>
      <parameter type-id='7292109c' name='tz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/interval.c' language='LANG_C99'>
    <typedef-decl name='interval' type-id='5a9386a0' id='6d2a6f9d'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='6d2a6f9d' visibility='default' id='5a9386a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='time' type-id='27dc5d97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='month' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='6d2a6f9d' size-in-bits='64' id='f8b8e016'/>
    <function-decl name='PGTYPESinterval_copy' mangled-name='PGTYPESinterval_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESinterval_copy'>
      <parameter type-id='f8b8e016' name='intvlsrc'/>
      <parameter type-id='f8b8e016' name='intvldest'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESinterval_to_asc' mangled-name='PGTYPESinterval_to_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESinterval_to_asc'>
      <parameter type-id='f8b8e016' name='span'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='PGTYPESinterval_from_asc' mangled-name='PGTYPESinterval_from_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESinterval_from_asc'>
      <parameter type-id='26a90f95' name='str'/>
      <parameter type-id='9b23c9ad' name='endptr'/>
      <return type-id='f8b8e016'/>
    </function-decl>
    <function-decl name='PGTYPESinterval_free' mangled-name='PGTYPESinterval_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESinterval_free'>
      <parameter type-id='f8b8e016' name='intvl'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESinterval_new' mangled-name='PGTYPESinterval_new' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESinterval_new'>
      <return type-id='f8b8e016'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/numeric.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='e7f23298' size-in-bits='240' id='0851116c'>
      <subrange length='30' type-id='7359adad' id='6a6183a4'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <typedef-decl name='decimal' type-id='c956c942' id='4120637b'/>
    <class-decl name='__anonymous_struct__' size-in-bits='416' is-struct='yes' is-anonymous='yes' naming-typedef-id='4120637b' visibility='default' id='c956c942'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ndigits' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='weight' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rscale' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dscale' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='digits' type-id='0851116c' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NumericDigit' type-id='002ac4a6' id='e7f23298'/>
    <typedef-decl name='numeric' type-id='e0002629' id='3c20c58f'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='3c20c58f' visibility='default' id='e0002629'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ndigits' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='weight' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rscale' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dscale' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf' type-id='09248375' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='digits' type-id='09248375' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='e7f23298' size-in-bits='64' id='09248375'/>
    <pointer-type-def type-id='4120637b' size-in-bits='64' id='40769792'/>
    <pointer-type-def type-id='a0eb0f08' size-in-bits='64' id='7408d286'/>
    <pointer-type-def type-id='bd54fe1a' size-in-bits='64' id='3ccc2590'/>
    <pointer-type-def type-id='3c20c58f' size-in-bits='64' id='816a93e6'/>
    <function-decl name='PGTYPESnumeric_from_decimal' mangled-name='PGTYPESnumeric_from_decimal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_from_decimal'>
      <parameter type-id='40769792' name='src'/>
      <parameter type-id='816a93e6' name='dst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_to_decimal' mangled-name='PGTYPESnumeric_to_decimal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_to_decimal'>
      <parameter type-id='816a93e6' name='src'/>
      <parameter type-id='40769792' name='dst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_to_long' mangled-name='PGTYPESnumeric_to_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_to_long'>
      <parameter type-id='816a93e6' name='nv'/>
      <parameter type-id='3ccc2590' name='lp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_to_int' mangled-name='PGTYPESnumeric_to_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_to_int'>
      <parameter type-id='816a93e6' name='nv'/>
      <parameter type-id='7292109c' name='ip'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_to_double' mangled-name='PGTYPESnumeric_to_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_to_double'>
      <parameter type-id='816a93e6' name='nv'/>
      <parameter type-id='7408d286' name='dp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_from_double' mangled-name='PGTYPESnumeric_from_double' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_from_double'>
      <parameter type-id='a0eb0f08' name='d'/>
      <parameter type-id='816a93e6' name='dst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_copy' mangled-name='PGTYPESnumeric_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_copy'>
      <parameter type-id='816a93e6' name='src'/>
      <parameter type-id='816a93e6' name='dst'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_from_long' mangled-name='PGTYPESnumeric_from_long' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_from_long'>
      <parameter type-id='bd54fe1a' name='long_val'/>
      <parameter type-id='816a93e6' name='var'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_from_int' mangled-name='PGTYPESnumeric_from_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_from_int'>
      <parameter type-id='95e97e5e' name='int_val'/>
      <parameter type-id='816a93e6' name='var'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_cmp' mangled-name='PGTYPESnumeric_cmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_cmp'>
      <parameter type-id='816a93e6' name='var1'/>
      <parameter type-id='816a93e6' name='var2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_div' mangled-name='PGTYPESnumeric_div' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_div'>
      <parameter type-id='816a93e6' name='var1'/>
      <parameter type-id='816a93e6' name='var2'/>
      <parameter type-id='816a93e6' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_mul' mangled-name='PGTYPESnumeric_mul' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_mul'>
      <parameter type-id='816a93e6' name='var1'/>
      <parameter type-id='816a93e6' name='var2'/>
      <parameter type-id='816a93e6' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_sub' mangled-name='PGTYPESnumeric_sub' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_sub'>
      <parameter type-id='816a93e6' name='var1'/>
      <parameter type-id='816a93e6' name='var2'/>
      <parameter type-id='816a93e6' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_add' mangled-name='PGTYPESnumeric_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_add'>
      <parameter type-id='816a93e6' name='var1'/>
      <parameter type-id='816a93e6' name='var2'/>
      <parameter type-id='816a93e6' name='result'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPESdecimal_free' mangled-name='PGTYPESdecimal_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdecimal_free'>
      <parameter type-id='40769792' name='var'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_free' mangled-name='PGTYPESnumeric_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_free'>
      <parameter type-id='816a93e6' name='var'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_to_asc' mangled-name='PGTYPESnumeric_to_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_to_asc'>
      <parameter type-id='816a93e6' name='num'/>
      <parameter type-id='95e97e5e' name='dscale'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_from_asc' mangled-name='PGTYPESnumeric_from_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_from_asc'>
      <parameter type-id='26a90f95' name='str'/>
      <parameter type-id='9b23c9ad' name='endptr'/>
      <return type-id='816a93e6'/>
    </function-decl>
    <function-decl name='PGTYPESdecimal_new' mangled-name='PGTYPESdecimal_new' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESdecimal_new'>
      <return type-id='40769792'/>
    </function-decl>
    <function-decl name='PGTYPESnumeric_new' mangled-name='PGTYPESnumeric_new' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPESnumeric_new'>
      <return type-id='816a93e6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../src/interfaces/ecpg/pgtypeslib/timestamp.c' language='LANG_C99'>
    <function-decl name='PGTYPEStimestamp_sub_interval' mangled-name='PGTYPEStimestamp_sub_interval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_sub_interval'>
      <parameter type-id='0e885d2b' name='tin'/>
      <parameter type-id='f8b8e016' name='span'/>
      <parameter type-id='0e885d2b' name='tout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_add_interval' mangled-name='PGTYPEStimestamp_add_interval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_add_interval'>
      <parameter type-id='0e885d2b' name='tin'/>
      <parameter type-id='f8b8e016' name='span'/>
      <parameter type-id='0e885d2b' name='tout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_defmt_asc' mangled-name='PGTYPEStimestamp_defmt_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_defmt_asc'>
      <parameter type-id='80f4b756' name='str'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter type-id='0e885d2b' name='d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_sub' mangled-name='PGTYPEStimestamp_sub' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_sub'>
      <parameter type-id='0e885d2b' name='ts1'/>
      <parameter type-id='0e885d2b' name='ts2'/>
      <parameter type-id='f8b8e016' name='iv'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_fmt_asc' mangled-name='PGTYPEStimestamp_fmt_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_fmt_asc'>
      <parameter type-id='0e885d2b' name='ts'/>
      <parameter type-id='26a90f95' name='output'/>
      <parameter type-id='95e97e5e' name='str_len'/>
      <parameter type-id='80f4b756' name='fmtstr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_current' mangled-name='PGTYPEStimestamp_current' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_current'>
      <parameter type-id='0e885d2b' name='ts'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_to_asc' mangled-name='PGTYPEStimestamp_to_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_to_asc'>
      <parameter type-id='71758a2c' name='tstamp'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='PGTYPEStimestamp_from_asc' mangled-name='PGTYPEStimestamp_from_asc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PGTYPEStimestamp_from_asc'>
      <parameter type-id='26a90f95' name='str'/>
      <parameter type-id='9b23c9ad' name='endptr'/>
      <return type-id='71758a2c'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
